{
  "source": {
    "pdf": "official_senior_high_english_curriculum_2020.pdf",
    "official_issue_date": "2020-05-11",
    "official_notice_date": "2020-06-03",
    "notes": [
      "Senior-high matching is derived from Appendix 2 of the official Senior High School English Curriculum Standard (2017 edition, 2020 revision).",
      "The high-school bucket uses starred entries only: one-star entries are required senior-high vocabulary and two-star entries are selective-required senior-high vocabulary.",
      "The searchable PDF text exposes 1497 starred lines. Slash-combined entries such as salesman/saleswoman share single lines, so raw extracted line counts and split form counts are stored separately.",
      "Country-name reference tables are preserved separately for auditability but are not used to drive stage matching because the appendix marks them as teaching reference material."
    ]
  },
  "required_entries": [
    "absolutely",
    "accident",
    "account",
    "ache",
    "achievement",
    "acquire",
    "actually",
    "adapt",
    "addict",
    "addition",
    "admire",
    "admit",
    "adult",
    "advance",
    "adventure",
    "affair",
    "agriculture",
    "ahead",
    "aid",
    "aim",
    "alarm",
    "a.m.",
    "amazing",
    "amount",
    "announce",
    "annual",
    "anxious",
    "apartment",
    "apologise (apologize)",
    "application",
    "apply",
    "approach",
    "argue",
    "arrangement",
    "aspect",
    "assume",
    "athlete",
    "Atlantic",
    "attach",
    "attack",
    "attempt",
    "attitude",
    "attract",
    "audience",
    "author",
    "authority",
    "average",
    "award",
    "aware",
    "awkward",
    "badminton",
    "balance",
    "ballet",
    "band",
    "bar",
    "base",
    "basis",
    "battery",
    "battle",
    "beer",
    "behaviour (behavior)",
    "belong",
    "belt",
    "beneath",
    "benefit",
    "beyond",
    "bite",
    "blog",
    "bone",
    "boot",
    "boxing",
    "branch",
    "breathe",
    "brief",
    "broad",
    "brochure",
    "butter",
    "button",
    "café",
    "calm",
    "campus",
    "capable",
    "carbon",
    "case",
    "cash",
    "cattle",
    "chain",
    "challenge",
    "champion",
    "chapter",
    "character",
    "charge",
    "charity",
    "chat",
    "chief",
    "china",
    "clap",
    "click",
    "climate",
    "collection",
    "comment",
    "committee",
    "company",
    "concentrate",
    "concern",
    "conduct",
    "conference",
    "confidence",
    "confirm",
    "congratulation",
    "contact",
    "contain",
    "content",
    "context",
    "continent",
    "contribution",
    "convenient",
    "county",
    "court",
    "crash",
    "creative",
    "credit",
    "crowd",
    "cure",
    "curious",
    "current",
    "custom",
    "data",
    "death",
    "declare",
    "decorate",
    "deer",
    "defence (defense)",
    "definitely",
    "deliver",
    "description",
    "desert",
    "design",
    "desire",
    "despite",
    "destination",
    "destroy",
    "detail",
    "determine",
    "diagram",
    "diet",
    "digital",
    "dinosaur",
    "disappear",
    "disaster",
    "disease",
    "distance",
    "document",
    "dolphin",
    "donate",
    "download",
    "downstairs",
    "downtown",
    "dragon",
    "drought",
    "due to",
    "duty",
    "eager",
    "earn",
    "editor",
    "effect",
    "effort",
    "electricity",
    "element",
    "enable",
    "energetic",
    "energy",
    "engine",
    "ensure",
    "entirely",
    "entrance",
    "envelope",
    "equal",
    "equipment",
    "error",
    "erupt",
    "escape",
    "establish",
    "eve",
    "event",
    "eventually",
    "exchange",
    "exist",
    "exit",
    "experiment",
    "expert",
    "explore",
    "export",
    "extent",
    "external",
    "extinction",
    "extra",
    "extremely",
    "facility",
    "factor",
    "failure",
    "familiar",
    "fancy",
    "feature",
    "female",
    "figure",
    "file",
    "flash",
    "flat",
    "flexible",
    "flight",
    "flood",
    "focus",
    "formal",
    "former",
    "fortunately",
    "forward",
    "frank",
    "frequently",
    "frightened",
    "function",
    "fund",
    "further",
    "gap",
    "gas",
    "gather",
    "generation",
    "generous",
    "global",
    "goal",
    "goods",
    "graduate",
    "greenhouse",
    "guideline",
    "guy",
    "gym",
    "gymnastics",
    "hesitate",
    "honey",
    "honour (honor)",
    "horrible",
    "host",
    "hug",
    "hurricane",
    "identity",
    "ignore",
    "illustrate",
    "image",
    "immediately",
    "impact",
    "import",
    "impression",
    "improve",
    "income",
    "indeed",
    "independent",
    "indicate",
    "individual",
    "insect",
    "inspire",
    "intelligent",
    "intend",
    "issue",
    "jeans",
    "jog",
    "journal",
    "joy",
    "judge",
    "junior",
    "justice",
    "kangaroo",
    "lantern",
    "lap",
    "lecture",
    "length",
    "likely",
    "limited",
    "literature",
    "living",
    "location",
    "loss",
    "maintain",
    "major",
    "majority",
    "male",
    "march",
    "marriage",
    "mass",
    "master",
    "material",
    "measure",
    "medal",
    "medium (pl. media)",
    "memory",
    "mental",
    "merry",
    "metal",
    "midnight",
    "military",
    "moment",
    "moreover",
    "movement",
    "narrow",
    "nation",
    "nationality",
    "nearby",
    "neat",
    "negative",
    "normal",
    "nowadays",
    "nowhere",
    "nut",
    "observe",
    "obviously",
    "occasion",
    "occur",
    "ocean",
    "odd",
    "official",
    "onto",
    "opera",
    "operation",
    "opinion",
    "opportunity",
    "option",
    "ordinary",
    "organisation (organization)",
    "original",
    "otherwise",
    "ought to",
    "overseas",
    "oxygen",
    "package",
    "particular",
    "partner",
    "passive",
    "path",
    "pattern",
    "per",
    "percent",
    "percentage",
    "performance",
    "permit",
    "personality",
    "petrol",
    "piano",
    "plate",
    "plus",
    "p.m.",
    "poetry",
    "poison",
    "pole",
    "policy",
    "port",
    "position",
    "positive",
    "poster",
    "postpone",
    "power",
    "prefer",
    "press",
    "pressure",
    "prevent",
    "previous",
    "procedure",
    "process",
    "professional",
    "profit",
    "proposal",
    "protest",
    "prove",
    "province",
    "publish",
    "pudding",
    "quality",
    "quit",
    "range",
    "rate",
    "rather",
    "reaction",
    "recognise (recognize)",
    "recommend",
    "recover",
    "reduce",
    "refer",
    "reflect",
    "regard",
    "region",
    "regular",
    "relief",
    "remind",
    "remove",
    "replace",
    "represent",
    "republic",
    "request",
    "resource",
    "respect",
    "respond",
    "response",
    "responsible",
    "retire",
    "reveal",
    "revise",
    "roll",
    "romantic",
    "satisfaction",
    "scare",
    "scene",
    "schedule",
    "section",
    "seek",
    "select",
    "senior",
    "series",
    "settle",
    "sex",
    "shallow",
    "sharp",
    "sheet",
    "shock",
    "shoot",
    "sight",
    "signal",
    "significant",
    "site",
    "ski",
    "skin",
    "slide",
    "slightly",
    "slim",
    "smog",
    "snack",
    "soccer",
    "software",
    "solution",
    "somehow",
    "sort",
    "source",
    "specific",
    "staff",
    "stage",
    "stair",
    "strategy",
    "strength",
    "stress",
    "struggle",
    "studio",
    "stuff",
    "style",
    "subway",
    "suffer",
    "sufficient",
    "summary",
    "super",
    "supply",
    "surf",
    "surround",
    "survive",
    "sweat",
    "system",
    "talent",
    "target",
    "tear",
    "technique",
    "teenager",
    "tend",
    "theme",
    "therefore",
    "throughout",
    "thus",
    "tip",
    "tissue",
    "title",
    "topic",
    "tough",
    "track",
    "tradition",
    "transport",
    "treatment",
    "turkey",
    "type",
    "typical",
    "unique",
    "update",
    "upper",
    "variety",
    "various",
    "vehicle",
    "view",
    "volcano",
    "volunteer",
    "wedding",
    "whale",
    "Wi-Fi",
    "wine",
    "within"
  ],
  "required_entry_line_count": 497,
  "required_split_form_count": 497,
  "required_match_forms": [
    "a.m.",
    "absolutely",
    "accident",
    "account",
    "ache",
    "achievement",
    "acquire",
    "actually",
    "adapt",
    "addict",
    "addition",
    "admire",
    "admit",
    "adult",
    "advance",
    "adventure",
    "affair",
    "agriculture",
    "ahead",
    "aid",
    "aim",
    "alarm",
    "amazing",
    "amount",
    "announce",
    "annual",
    "anxious",
    "apartment",
    "apologize",
    "application",
    "apply",
    "approach",
    "argue",
    "arrangement",
    "aspect",
    "assume",
    "athlete",
    "atlantic",
    "attach",
    "attack",
    "attempt",
    "attitude",
    "attract",
    "audience",
    "author",
    "authority",
    "average",
    "award",
    "aware",
    "awkward",
    "badminton",
    "balance",
    "ballet",
    "band",
    "bar",
    "base",
    "basis",
    "battery",
    "battle",
    "beer",
    "behavior",
    "behaviour",
    "belong",
    "belt",
    "beneath",
    "benefit",
    "beyond",
    "bite",
    "bone",
    "boot",
    "boxing",
    "branch",
    "breathe",
    "brief",
    "broad",
    "brochure",
    "butter",
    "button",
    "cafe",
    "calm",
    "campus",
    "capable",
    "carbon",
    "case",
    "cash",
    "cattle",
    "chain",
    "challenge",
    "champion",
    "chapter",
    "character",
    "charge",
    "charity",
    "chat",
    "chief",
    "china",
    "clap",
    "click",
    "climate",
    "collection",
    "comment",
    "committee",
    "company",
    "concentrate",
    "concern",
    "conduct",
    "conference",
    "confidence",
    "confirm",
    "congratulation",
    "contact",
    "contain",
    "content",
    "context",
    "continent",
    "contribution",
    "convenient",
    "county",
    "court",
    "crash",
    "creative",
    "credit",
    "crowd",
    "cure",
    "curious",
    "current",
    "custom",
    "data",
    "death",
    "declare",
    "decorate",
    "deer",
    "defence",
    "defense",
    "definitely",
    "deliver",
    "description",
    "desert",
    "design",
    "desire",
    "despite",
    "destination",
    "destroy",
    "detail",
    "determine",
    "diagram",
    "diet",
    "digital",
    "dinosaur",
    "disappear",
    "disaster",
    "disease",
    "distance",
    "document",
    "dolphin",
    "donate",
    "download",
    "downstairs",
    "downtown",
    "dragon",
    "drought",
    "duty",
    "eager",
    "earn",
    "editor",
    "effect",
    "effort",
    "electricity",
    "element",
    "enable",
    "energetic",
    "energy",
    "engine",
    "ensure",
    "entrance",
    "envelope",
    "equal",
    "equipment",
    "error",
    "erupt",
    "escape",
    "establish",
    "eve",
    "event",
    "eventually",
    "exchange",
    "exist",
    "exit",
    "experiment",
    "expert",
    "explore",
    "export",
    "extent",
    "external",
    "extinction",
    "extra",
    "extremely",
    "facility",
    "factor",
    "failure",
    "familiar",
    "fancy",
    "feature",
    "female",
    "figure",
    "file",
    "flash",
    "flat",
    "flexible",
    "flight",
    "flood",
    "focus",
    "formal",
    "former",
    "fortunately",
    "forward",
    "frank",
    "frequently",
    "function",
    "fund",
    "further",
    "gap",
    "gas",
    "gather",
    "generation",
    "generous",
    "global",
    "goal",
    "goods",
    "graduate",
    "greenhouse",
    "guideline",
    "guy",
    "gym",
    "gymnastics",
    "hesitate",
    "honey",
    "honor",
    "honour",
    "horrible",
    "host",
    "hug",
    "hurricane",
    "identity",
    "ignore",
    "illustrate",
    "image",
    "immediately",
    "impact",
    "import",
    "impression",
    "improve",
    "income",
    "indeed",
    "independent",
    "indicate",
    "individual",
    "insect",
    "inspire",
    "intelligent",
    "intend",
    "issue",
    "jeans",
    "jog",
    "journal",
    "joy",
    "judge",
    "junior",
    "justice",
    "kangaroo",
    "lantern",
    "lap",
    "lecture",
    "length",
    "likely",
    "limited",
    "literature",
    "living",
    "location",
    "loss",
    "maintain",
    "major",
    "majority",
    "male",
    "march",
    "marriage",
    "mass",
    "master",
    "material",
    "measure",
    "medal",
    "media",
    "medium",
    "memory",
    "mental",
    "merry",
    "metal",
    "midnight",
    "military",
    "moment",
    "moreover",
    "movement",
    "narrow",
    "nation",
    "nationality",
    "nearby",
    "neat",
    "negative",
    "normal",
    "nowadays",
    "nowhere",
    "nut",
    "observe",
    "obviously",
    "occasion",
    "occur",
    "ocean",
    "odd",
    "official",
    "onto",
    "opera",
    "operation",
    "opinion",
    "opportunity",
    "option",
    "ordinary",
    "organization",
    "original",
    "otherwise",
    "overseas",
    "oxygen",
    "p.m.",
    "package",
    "particular",
    "partner",
    "passive",
    "path",
    "pattern",
    "per",
    "percent",
    "percentage",
    "performance",
    "permit",
    "personality",
    "petrol",
    "piano",
    "plate",
    "plus",
    "poetry",
    "poison",
    "pole",
    "policy",
    "port",
    "position",
    "positive",
    "poster",
    "postpone",
    "power",
    "prefer",
    "press",
    "pressure",
    "prevent",
    "previous",
    "procedure",
    "process",
    "professional",
    "profit",
    "proposal",
    "protest",
    "prove",
    "province",
    "publish",
    "pudding",
    "quality",
    "quit",
    "range",
    "rate",
    "rather",
    "reaction",
    "recognise",
    "recognize",
    "recommend",
    "recover",
    "reduce",
    "refer",
    "reflect",
    "regard",
    "region",
    "regular",
    "relief",
    "remind",
    "remove",
    "replace",
    "represent",
    "republic",
    "request",
    "resource",
    "respect",
    "respond",
    "response",
    "responsible",
    "retire",
    "reveal",
    "revise",
    "roll",
    "romantic",
    "satisfaction",
    "scare",
    "scene",
    "schedule",
    "section",
    "seek",
    "select",
    "senior",
    "series",
    "settle",
    "sex",
    "shallow",
    "sharp",
    "sheet",
    "shock",
    "shoot",
    "sight",
    "signal",
    "significant",
    "site",
    "ski",
    "skin",
    "slide",
    "slightly",
    "slim",
    "smog",
    "snack",
    "soccer",
    "software",
    "solution",
    "somehow",
    "sort",
    "source",
    "specific",
    "staff",
    "stage",
    "stair",
    "strategy",
    "strength",
    "stress",
    "struggle",
    "studio",
    "stuff",
    "style",
    "subway",
    "suffer",
    "sufficient",
    "summary",
    "super",
    "supply",
    "surf",
    "surround",
    "survive",
    "sweat",
    "system",
    "talent",
    "target",
    "technique",
    "teenager",
    "tend",
    "theme",
    "therefore",
    "throughout",
    "thus",
    "tip",
    "tissue",
    "title",
    "topic",
    "tough",
    "track",
    "tradition",
    "transport",
    "treatment",
    "turkey",
    "type",
    "typical",
    "unique",
    "update",
    "upper",
    "variety",
    "various",
    "vehicle",
    "view",
    "volcano",
    "volunteer",
    "wedding",
    "whale",
    "wine",
    "within"
  ],
  "selective_required_entries": [
    "abandon",
    "abnormal",
    "aboard",
    "absence",
    "absorb",
    "abstract",
    "abuse",
    "academic",
    "accent",
    "access",
    "accommodation",
    "accompany",
    "accurate",
    "accuse",
    "acid",
    "acknowledge",
    "AD",
    "adaptation",
    "adjust",
    "administration",
    "adopt",
    "adorable",
    "advertise",
    "advertisement (ad)",
    "advocate",
    "affect",
    "afterward",
    "agency",
    "agenda",
    "airline",
    "alcohol",
    "alongside",
    "alternative",
    "altogether",
    "amateur",
    "ambition",
    "ambitious",
    "ambulance",
    "amuse",
    "analyse (analyze)",
    "ancestor",
    "anger",
    "angle",
    "ankle",
    "annoy",
    "anticipate",
    "antique",
    "anxiety",
    "anyhow",
    "apart",
    "apparently",
    "appeal",
    "appetite",
    "applaud",
    "applicant",
    "appointment",
    "appreciate",
    "appropriate",
    "approve",
    "arch",
    "architect",
    "arise",
    "arrest",
    "arrow",
    "artificial",
    "ashamed",
    "aside",
    "assess",
    "assign",
    "assistant",
    "association",
    "assumption",
    "astonish",
    "astronaut",
    "astronomer",
    "atmosphere",
    "attain",
    "automatic",
    "autonomous",
    "available",
    "awesome",
    "backward",
    "bacon",
    "bakery",
    "ban",
    "barbecue",
    "barely",
    "bark",
    "barrier",
    "basin",
    "bat",
    "bath",
    "bay",
    "BC",
    "bean curd (tofu)",
    "beard",
    "beauty",
    "behalf",
    "behave",
    "being",
    "belief",
    "bend",
    "bet",
    "billion",
    "biology",
    "bitter",
    "blame",
    "blank",
    "blanket",
    "bleed",
    "bless",
    "boil",
    "bomb",
    "bond",
    "bonus",
    "boost",
    "border",
    "botanical",
    "bother",
    "bounce",
    "bound",
    "boundary",
    "bow",
    "bowling",
    "breast",
    "breath",
    "brick",
    "bride/bridegroom",
    "brilliant",
    "broadcast",
    "budget",
    "buffet",
    "bunch",
    "bury",
    "butcher",
    "cabbage",
    "cafeteria",
    "cage",
    "calculate",
    "calligraphy",
    "calorie",
    "camel",
    "campaign",
    "canal",
    "cancer",
    "candidate",
    "canteen",
    "capacity",
    "capsule",
    "captain",
    "career",
    "carpet",
    "carve",
    "cast",
    "castle",
    "category",
    "cave",
    "cease",
    "ceiling",
    "celebrity",
    "cell",
    "centimetre (centimeter)",
    "certificate",
    "chairman/chairwoman",
    "channel",
    "chaos",
    "characteristic",
    "chart",
    "cheat",
    "cheek",
    "cheese",
    "chef",
    "chemical",
    "chemist",
    "chest",
    "chew",
    "choke",
    "chorus",
    "church",
    "cigarette",
    "circuit",
    "circumstance",
    "circus",
    "cite",
    "citizen",
    "civil",
    "civilian",
    "civilisation (civilization)",
    "claim",
    "clarify",
    "classic",
    "clay",
    "clerk",
    "client",
    "clinic",
    "clone",
    "cloth",
    "clue",
    "collapse",
    "collar",
    "column",
    "combine",
    "comedy",
    "comfort",
    "comic",
    "commercial",
    "commit",
    "commitment",
    "communist",
    "comparison",
    "compete",
    "competence",
    "complain",
    "complex",
    "complicated",
    "component",
    "compose",
    "composition",
    "comprehension",
    "comprehensive",
    "comprise",
    "concept",
    "conclude",
    "conclusion",
    "concrete",
    "conflict",
    "Confucianism",
    "Confucius",
    "confused",
    "consequence",
    "conservation",
    "consist",
    "consistent",
    "constant",
    "constitution",
    "construction",
    "consultant",
    "consultation",
    "consume",
    "consumption",
    "contemporary",
    "contest",
    "contract",
    "contradictory",
    "contrary",
    "contrast",
    "conventional",
    "convince",
    "cooperate",
    "core",
    "corporate",
    "correspond",
    "costume",
    "cottage",
    "cotton",
    "council",
    "coverage",
    "cream",
    "creature",
    "crew",
    "crime",
    "crisis",
    "criterion (pl. criteria)",
    "critical",
    "criticise (criticize)",
    "crop",
    "crucial",
    "cruel",
    "cuisine",
    "cupboard",
    "curtain",
    "cycle",
    "damage",
    "damp",
    "dare",
    "database",
    "deadline",
    "debate",
    "debt",
    "decade",
    "decent",
    "decline",
    "decrease",
    "defeat",
    "defend",
    "definition",
    "delay",
    "delete",
    "delicate",
    "demand",
    "demonstrate",
    "dentist",
    "deny",
    "department",
    "departure",
    "depress",
    "depth",
    "deserve",
    "desperate",
    "dessert",
    "detect",
    "detective",
    "device",
    "devote",
    "diamond",
    "differ",
    "digest",
    "dignity",
    "dimension",
    "directory",
    "disability",
    "disabled",
    "disappointed",
    "discipline",
    "discount",
    "discrimination",
    "disk (disc)",
    "dismiss",
    "display",
    "distant",
    "distinct",
    "distinguish",
    "distribution",
    "district",
    "disturb",
    "dive",
    "diverse",
    "division",
    "dizzy",
    "domain",
    "domestic",
    "dominate",
    "dormitory",
    "dozen",
    "draft",
    "drag",
    "drama",
    "dramatic",
    "drawer",
    "drill",
    "drug",
    "duration",
    "dust",
    "dynamic",
    "dynasty",
    "eagle",
    "ease",
    "ecology",
    "economic",
    "edge",
    "educator",
    "efficient",
    "elderly",
    "election",
    "elegant",
    "elsewhere",
    "embarrassed",
    "emerge",
    "emergency",
    "emotion",
    "emperor",
    "emphasis",
    "employ",
    "encounter",
    "engage",
    "enhance",
    "enormous",
    "enterprise",
    "entertainment",
    "enthusiastic",
    "entitle",
    "entry",
    "envy",
    "episode",
    "equator",
    "era",
    "essay",
    "essential",
    "estate",
    "estimate",
    "evaluate",
    "evidence",
    "examine",
    "exceptional",
    "exhibition",
    "expand",
    "expansion",
    "expectation",
    "expense",
    "explode",
    "expose",
    "exposure",
    "extend",
    "extension",
    "extraordinary",
    "fabric",
    "facilitate",
    "faith",
    "false",
    "fantasy",
    "fashion",
    "fault",
    "favour (favor)",
    "fee",
    "fellow",
    "fence",
    "fetch",
    "fibre (fiber)",
    "fiction",
    "finance",
    "financial",
    "finding",
    "firm",
    "fist",
    "flavour (flavor)",
    "flour",
    "flow",
    "flu",
    "fluent",
    "foggy",
    "fold",
    "folk",
    "fond",
    "forecast",
    "forehead",
    "forever",
    "forgive",
    "format",
    "found",
    "foundation",
    "fountain",
    "fox",
    "freedom",
    "freeze",
    "frequency",
    "friction",
    "frog",
    "frontier",
    "frost",
    "fry",
    "fuel",
    "fundamental",
    "furniture",
    "gain",
    "gallery",
    "garbage",
    "garlic",
    "gender",
    "generate",
    "genius",
    "gentle",
    "genuine",
    "geometry",
    "gifted",
    "globe",
    "goat",
    "golf",
    "grab",
    "gradually",
    "grain",
    "gramme (gram)",
    "grand",
    "grasp",
    "grateful",
    "gravity",
    "greedy",
    "greet",
    "grocery",
    "guarantee",
    "guidance",
    "guilty",
    "habitat",
    "ham",
    "handkerchief",
    "handle",
    "handwriting",
    "harm",
    "harmonious",
    "harmony",
    "harvest",
    "hatch",
    "hence",
    "herb",
    "highlight",
    "hike",
    "hire",
    "historic",
    "household",
    "housing",
    "humble",
    "hunt",
    "hydrogen",
    "ideal",
    "identical",
    "identify",
    "idiom",
    "illegal",
    "imply",
    "impress",
    "inch",
    "incident",
    "incredible",
    "infection",
    "infer",
    "influential",
    "initial",
    "initiative",
    "injury",
    "inner",
    "innocent",
    "innovation",
    "input",
    "inquire",
    "insight",
    "insist",
    "inspection",
    "instance",
    "instant",
    "institute",
    "institution",
    "insurance",
    "integrate",
    "integrity",
    "intense",
    "intention",
    "interaction",
    "internal",
    "interpret",
    "interrupt",
    "intervention",
    "investigate",
    "investment",
    "involve",
    "iron",
    "item",
    "jam",
    "jaw",
    "jazz",
    "joint",
    "journalist",
    "jungle",
    "justify",
    "kettle",
    "kindergarten",
    "kingdom",
    "kit",
    "label",
    "labour (labor)",
    "lack",
    "lamb",
    "lamp",
    "landscape",
    "laptop",
    "launch",
    "lawyer",
    "leadership",
    "league",
    "leak",
    "leather",
    "legal",
    "leisure",
    "liberation",
    "liberty",
    "librarian",
    "license",
    "limit",
    "link",
    "liquid",
    "literally",
    "literary",
    "load",
    "loan",
    "log",
    "logical",
    "loose",
    "lower",
    "lunar",
    "lung",
    "luxury",
    "madam",
    "mail",
    "mankind",
    "manner",
    "marathon",
    "massive",
    "mature",
    "maximum",
    "means",
    "mechanic",
    "membership",
    "memorial",
    "mercy",
    "merely",
    "microscope",
    "mild",
    "millimetre (millimeter)",
    "million",
    "mineral",
    "minimum",
    "minister",
    "minor",
    "minority",
    "mirror",
    "missile",
    "mission",
    "mist",
    "mixture",
    "mode",
    "monitor",
    "monthly",
    "mood",
    "moral",
    "mosquito",
    "mostly",
    "motion",
    "motivate",
    "motive",
    "motor",
    "mount",
    "mud",
    "multiple",
    "murder",
    "muscle",
    "mushroom",
    "nail",
    "native",
    "navy",
    "needle",
    "negotiate",
    "neighbourhood (neighborhood)",
    "nephew",
    "nest",
    "net",
    "network",
    "nevertheless",
    "niece",
    "noble",
    "novel",
    "novelist",
    "nuclear",
    "nutrition",
    "objective",
    "obtain",
    "occupation",
    "occupy",
    "onion",
    "operator",
    "opponent",
    "oppose",
    "optimistic",
    "orbit",
    "organ",
    "organic",
    "origin",
    "outcome",
    "outgoing",
    "outline",
    "output",
    "outstanding",
    "overall",
    "overcome",
    "owe",
    "pace",
    "pack",
    "pan",
    "panel",
    "panic",
    "paragraph",
    "parcel",
    "parking",
    "participate",
    "passion",
    "patent",
    "patience",
    "peak",
    "pepper",
    "perceive",
    "permanent",
    "persuade",
    "pessimistic",
    "phase",
    "phenomenon",
    "philosophy",
    "photographer",
    "phrase",
    "physician",
    "pill",
    "pipe",
    "plain",
    "plastic",
    "platform",
    "pleasant",
    "plot",
    "plug",
    "poet",
    "polar",
    "polish",
    "political",
    "politician",
    "politics",
    "pond",
    "pork",
    "pose",
    "possession",
    "pot",
    "potential",
    "pour",
    "practical",
    "pray",
    "precious",
    "precisely",
    "predict",
    "preference",
    "prejudice",
    "premier",
    "presentation",
    "preserve",
    "pretend",
    "primitive",
    "principle",
    "prior",
    "priority",
    "prison",
    "proceed",
    "profession",
    "professor",
    "profile",
    "prohibit",
    "promote",
    "proof",
    "property",
    "prospect",
    "protein",
    "psychology",
    "pub",
    "purchase",
    "pure",
    "purse",
    "pursue",
    "qualification",
    "qualify",
    "quantity",
    "quote",
    "racial",
    "radiation",
    "radium",
    "rainbow",
    "random",
    "rank",
    "rare",
    "rating",
    "raw",
    "ray",
    "react",
    "realistic",
    "reality",
    "recall",
    "receipt",
    "receptionist",
    "recipe",
    "recite",
    "recognition",
    "recording",
    "recreation",
    "recycle",
    "reference",
    "reform",
    "refresh",
    "regardless",
    "register",
    "reject",
    "relate",
    "relay",
    "release",
    "relevant",
    "reliable",
    "rely",
    "remarkable",
    "remote",
    "rent",
    "representative",
    "reputation",
    "rescue",
    "reserve",
    "resident",
    "resign",
    "resistance",
    "resolution",
    "resolve",
    "respective",
    "responsibility",
    "restore",
    "restrict",
    "reward",
    "rhyme",
    "riddle",
    "rigid",
    "ripe",
    "roast",
    "rocket",
    "roof",
    "root",
    "route",
    "routine",
    "royal",
    "rubber",
    "rude",
    "rugby",
    "ruin",
    "rural",
    "sail",
    "salary",
    "salesman/saleswoman",
    "salty",
    "sample",
    "satellite",
    "saucer",
    "sausage",
    "saving",
    "saying",
    "scholarship",
    "scientific",
    "scream",
    "sculpture",
    "secondary",
    "secure",
    "security",
    "seed",
    "seize",
    "sensitive",
    "servant",
    "session",
    "setting",
    "severe",
    "sew",
    "shade",
    "shadow",
    "shark",
    "shave",
    "shelf",
    "shelter",
    "shift",
    "shore",
    "shortage",
    "sincerely",
    "sink",
    "skateboard",
    "skip",
    "slice",
    "slip",
    "sneeze",
    "socialist",
    "soil",
    "solar",
    "soldier",
    "solid",
    "somewhat",
    "sorrow",
    "soul",
    "sour",
    "sow",
    "specialist",
    "species",
    "splendid",
    "sponsor",
    "spot",
    "spy",
    "stability",
    "stadium",
    "stare",
    "starve",
    "statistic",
    "statue",
    "steak",
    "steam",
    "steel",
    "stimulate",
    "straightforward",
    "strait",
    "stream",
    "strengthen",
    "stretch",
    "strike",
    "string",
    "structure",
    "subjective",
    "submit",
    "subscribe",
    "subsequent",
    "substance",
    "substantial",
    "suburb",
    "suit",
    "suitable",
    "sum",
    "superb",
    "superior",
    "surgeon",
    "surgery",
    "surrounding",
    "suspect",
    "suspend",
    "sustain",
    "sweep",
    "swing",
    "switch",
    "symbol",
    "sympathy",
    "symphony",
    "tablet",
    "tackle",
    "tailor",
    "tale",
    "tank",
    "tax",
    "teapot",
    "telescope",
    "temple",
    "temporary",
    "tendency",
    "tension",
    "territory",
    "theft",
    "theory",
    "thinking",
    "thorough",
    "threat",
    "threaten",
    "thunder",
    "tight",
    "toast",
    "tobacco",
    "tolerate",
    "tone",
    "tournament",
    "towel",
    "transform",
    "trap",
    "trend",
    "trial",
    "trick",
    "trunk",
    "tube",
    "tune",
    "twin",
    "typhoon",
    "ultimately",
    "uniform",
    "universe",
    "unusual",
    "upset",
    "urban",
    "urge",
    "urgent",
    "valley",
    "variation",
    "vary",
    "vase",
    "vast",
    "venue",
    "version",
    "victim",
    "violence",
    "virtual",
    "virtue",
    "virus",
    "visible",
    "vision",
    "visual",
    "vital",
    "vivid",
    "vocabulary",
    "volume",
    "vote",
    "wage",
    "waist",
    "wander",
    "ward",
    "warning",
    "washroom",
    "wave",
    "weapon",
    "weed",
    "weekly",
    "weep",
    "welfare",
    "wheat",
    "whisper",
    "widespread",
    "wire",
    "wisdom",
    "withdraw",
    "witness",
    "wool",
    "worthwhile",
    "worthy",
    "wrap",
    "wrestle",
    "wrinkle",
    "wrist"
  ],
  "selective_required_entry_line_count": 1000,
  "selective_required_split_form_count": 1003,
  "selective_required_match_forms": [
    "abandon",
    "abnormal",
    "aboard",
    "absence",
    "absorb",
    "abstract",
    "abuse",
    "academic",
    "accent",
    "access",
    "accommodation",
    "accompany",
    "accurate",
    "accuse",
    "acid",
    "acknowledge",
    "ad",
    "adaptation",
    "adjust",
    "administration",
    "adopt",
    "advertise",
    "advertisement",
    "advocate",
    "affect",
    "afterward",
    "agency",
    "agenda",
    "airline",
    "alcohol",
    "alongside",
    "alternative",
    "altogether",
    "amateur",
    "ambition",
    "ambitious",
    "ambulance",
    "amuse",
    "analyse",
    "analyze",
    "ancestor",
    "anger",
    "angle",
    "ankle",
    "annoy",
    "anticipate",
    "antique",
    "anxiety",
    "anyhow",
    "apart",
    "appeal",
    "appetite",
    "applaud",
    "applicant",
    "appointment",
    "appreciate",
    "appropriate",
    "approve",
    "arch",
    "architect",
    "arise",
    "arrest",
    "arrow",
    "artificial",
    "ashamed",
    "aside",
    "assess",
    "assign",
    "assistant",
    "association",
    "assumption",
    "astonish",
    "astronaut",
    "astronomer",
    "atmosphere",
    "attain",
    "automatic",
    "autonomous",
    "available",
    "awesome",
    "backward",
    "bacon",
    "bakery",
    "ban",
    "barbecue",
    "barely",
    "bark",
    "barrier",
    "basin",
    "bat",
    "bath",
    "bay",
    "bc",
    "beard",
    "beauty",
    "behalf",
    "behave",
    "being",
    "belief",
    "bend",
    "bet",
    "billion",
    "biology",
    "bitter",
    "blame",
    "blank",
    "blanket",
    "bleed",
    "bless",
    "boil",
    "bomb",
    "bond",
    "bonus",
    "boost",
    "border",
    "botanical",
    "bother",
    "bounce",
    "bound",
    "boundary",
    "bow",
    "bowling",
    "breast",
    "breath",
    "brick",
    "bride",
    "bridegroom",
    "brilliant",
    "broadcast",
    "budget",
    "buffet",
    "bunch",
    "bury",
    "butcher",
    "cabbage",
    "cafeteria",
    "cage",
    "calculate",
    "calorie",
    "camel",
    "campaign",
    "canal",
    "cancer",
    "candidate",
    "canteen",
    "capacity",
    "capsule",
    "captain",
    "career",
    "carpet",
    "carve",
    "cast",
    "castle",
    "category",
    "cave",
    "cease",
    "ceiling",
    "cell",
    "centimetre",
    "certificate",
    "chairman",
    "chairwoman",
    "channel",
    "chaos",
    "characteristic",
    "chart",
    "cheat",
    "cheek",
    "cheese",
    "chef",
    "chemical",
    "chemist",
    "chest",
    "chew",
    "choke",
    "chorus",
    "church",
    "cigarette",
    "circuit",
    "circumstance",
    "circus",
    "cite",
    "citizen",
    "civil",
    "civilian",
    "civilization",
    "claim",
    "clarify",
    "classic",
    "clay",
    "clerk",
    "client",
    "clinic",
    "clone",
    "cloth",
    "clue",
    "collapse",
    "collar",
    "column",
    "combine",
    "comedy",
    "comfort",
    "comic",
    "commercial",
    "commit",
    "commitment",
    "communist",
    "comparison",
    "compete",
    "competence",
    "complain",
    "complex",
    "complicated",
    "component",
    "compose",
    "composition",
    "comprehension",
    "comprehensive",
    "comprise",
    "concept",
    "conclude",
    "conclusion",
    "concrete",
    "conflict",
    "consequence",
    "conservation",
    "consist",
    "consistent",
    "constant",
    "constitution",
    "construction",
    "consultant",
    "consultation",
    "consume",
    "consumption",
    "contemporary",
    "contest",
    "contract",
    "contradictory",
    "contrary",
    "contrast",
    "conventional",
    "convince",
    "cooperate",
    "core",
    "corporate",
    "correspond",
    "costume",
    "cottage",
    "cotton",
    "council",
    "coverage",
    "cream",
    "creature",
    "crew",
    "crime",
    "crisis",
    "criteria",
    "criterion",
    "critical",
    "criticize",
    "crop",
    "crucial",
    "cruel",
    "cuisine",
    "cupboard",
    "curtain",
    "cycle",
    "damage",
    "damp",
    "dare",
    "database",
    "deadline",
    "debate",
    "debt",
    "decade",
    "decent",
    "decline",
    "decrease",
    "defeat",
    "defend",
    "definition",
    "delay",
    "delete",
    "delicate",
    "demand",
    "demonstrate",
    "dentist",
    "deny",
    "department",
    "departure",
    "depress",
    "depth",
    "deserve",
    "desperate",
    "dessert",
    "detect",
    "detective",
    "device",
    "devote",
    "diamond",
    "differ",
    "digest",
    "dignity",
    "dimension",
    "directory",
    "disability",
    "disabled",
    "discipline",
    "discount",
    "discrimination",
    "disk",
    "dismiss",
    "display",
    "distant",
    "distinct",
    "distinguish",
    "distribution",
    "district",
    "disturb",
    "dive",
    "diverse",
    "division",
    "dizzy",
    "domain",
    "domestic",
    "dominate",
    "dormitory",
    "dozen",
    "draft",
    "drag",
    "drama",
    "dramatic",
    "drawer",
    "drill",
    "drug",
    "duration",
    "dust",
    "dynamic",
    "dynasty",
    "eagle",
    "ease",
    "ecology",
    "economic",
    "edge",
    "educator",
    "efficient",
    "elderly",
    "election",
    "elegant",
    "elsewhere",
    "embarrassed",
    "emerge",
    "emergency",
    "emotion",
    "emperor",
    "emphasis",
    "employ",
    "encounter",
    "engage",
    "enhance",
    "enormous",
    "enterprise",
    "entertainment",
    "enthusiastic",
    "entitle",
    "entry",
    "envy",
    "episode",
    "equator",
    "era",
    "essay",
    "essential",
    "estate",
    "estimate",
    "evaluate",
    "evidence",
    "examine",
    "exceptional",
    "exhibition",
    "expand",
    "expansion",
    "expectation",
    "expense",
    "explode",
    "expose",
    "exposure",
    "extend",
    "extension",
    "extraordinary",
    "fabric",
    "facilitate",
    "faith",
    "false",
    "fantasy",
    "fashion",
    "fault",
    "favor",
    "favour",
    "fee",
    "fellow",
    "fence",
    "fetch",
    "fibre",
    "fiction",
    "finance",
    "financial",
    "finding",
    "firm",
    "fist",
    "flavor",
    "flavour",
    "flour",
    "flow",
    "flu",
    "fluent",
    "foggy",
    "fold",
    "folk",
    "fond",
    "forecast",
    "forehead",
    "forever",
    "forgive",
    "format",
    "found",
    "foundation",
    "fountain",
    "fox",
    "freedom",
    "freeze",
    "frequency",
    "friction",
    "frog",
    "frontier",
    "frost",
    "fry",
    "fuel",
    "fundamental",
    "furniture",
    "gain",
    "gallery",
    "garbage",
    "garlic",
    "gender",
    "generate",
    "genius",
    "gentle",
    "genuine",
    "geometry",
    "gifted",
    "globe",
    "goat",
    "golf",
    "grab",
    "gradually",
    "grain",
    "gram",
    "gramme",
    "grand",
    "grasp",
    "grateful",
    "gravity",
    "greedy",
    "greet",
    "grocery",
    "guarantee",
    "guidance",
    "guilty",
    "ham",
    "handkerchief",
    "handle",
    "handwriting",
    "harm",
    "harmonious",
    "harmony",
    "harvest",
    "hatch",
    "hence",
    "herb",
    "highlight",
    "hike",
    "hire",
    "historic",
    "household",
    "housing",
    "humble",
    "hunt",
    "hydrogen",
    "ideal",
    "identical",
    "identify",
    "idiom",
    "illegal",
    "imply",
    "impress",
    "inch",
    "incident",
    "incredible",
    "infer",
    "influential",
    "initial",
    "initiative",
    "injury",
    "inner",
    "innocent",
    "innovation",
    "input",
    "inquire",
    "insight",
    "insist",
    "inspection",
    "instance",
    "instant",
    "institute",
    "institution",
    "insurance",
    "integrate",
    "integrity",
    "intense",
    "intention",
    "interaction",
    "internal",
    "interpret",
    "interrupt",
    "intervention",
    "investigate",
    "investment",
    "involve",
    "iron",
    "item",
    "jam",
    "jaw",
    "jazz",
    "joint",
    "journalist",
    "jungle",
    "justify",
    "kettle",
    "kindergarten",
    "kingdom",
    "kit",
    "label",
    "labour",
    "lack",
    "lamb",
    "lamp",
    "landscape",
    "launch",
    "lawyer",
    "leadership",
    "league",
    "leak",
    "leather",
    "legal",
    "leisure",
    "liberation",
    "liberty",
    "librarian",
    "license",
    "limit",
    "link",
    "liquid",
    "literally",
    "literary",
    "load",
    "loan",
    "log",
    "logical",
    "loose",
    "lower",
    "lunar",
    "lung",
    "luxury",
    "madam",
    "mail",
    "mankind",
    "manner",
    "marathon",
    "massive",
    "mature",
    "maximum",
    "means",
    "mechanic",
    "membership",
    "memorial",
    "mercy",
    "merely",
    "microscope",
    "mild",
    "millimetre",
    "million",
    "mineral",
    "minimum",
    "minister",
    "minor",
    "minority",
    "mirror",
    "missile",
    "mission",
    "mist",
    "mixture",
    "mode",
    "monitor",
    "monthly",
    "mood",
    "moral",
    "mosquito",
    "mostly",
    "motion",
    "motivate",
    "motive",
    "motor",
    "mount",
    "mud",
    "multiple",
    "murder",
    "muscle",
    "mushroom",
    "nail",
    "native",
    "navy",
    "needle",
    "negotiate",
    "neighborhood",
    "neighbourhood",
    "nephew",
    "nest",
    "net",
    "network",
    "nevertheless",
    "niece",
    "noble",
    "novel",
    "novelist",
    "nuclear",
    "nutrition",
    "objective",
    "obtain",
    "occupation",
    "occupy",
    "onion",
    "operator",
    "opponent",
    "oppose",
    "optimistic",
    "orbit",
    "organ",
    "organic",
    "origin",
    "outcome",
    "outgoing",
    "outline",
    "output",
    "outstanding",
    "overall",
    "overcome",
    "owe",
    "pace",
    "pack",
    "pan",
    "panel",
    "panic",
    "paragraph",
    "parcel",
    "parking",
    "participate",
    "passion",
    "patent",
    "patience",
    "peak",
    "pepper",
    "perceive",
    "permanent",
    "persuade",
    "pessimistic",
    "phase",
    "phenomenon",
    "philosophy",
    "photographer",
    "phrase",
    "physician",
    "pill",
    "pipe",
    "plain",
    "plastic",
    "platform",
    "pleasant",
    "plot",
    "plug",
    "poet",
    "polar",
    "polish",
    "political",
    "politician",
    "politics",
    "pond",
    "pork",
    "pose",
    "possession",
    "pot",
    "potential",
    "pour",
    "practical",
    "pray",
    "precious",
    "predict",
    "preference",
    "prejudice",
    "premier",
    "presentation",
    "preserve",
    "pretend",
    "primitive",
    "principle",
    "prior",
    "priority",
    "prison",
    "proceed",
    "profession",
    "professor",
    "profile",
    "prohibit",
    "promote",
    "proof",
    "property",
    "prospect",
    "protein",
    "psychology",
    "pub",
    "purchase",
    "pure",
    "purse",
    "pursue",
    "qualification",
    "qualify",
    "quantity",
    "quote",
    "racial",
    "radiation",
    "radium",
    "rainbow",
    "random",
    "rank",
    "rare",
    "rating",
    "raw",
    "ray",
    "react",
    "realistic",
    "reality",
    "recall",
    "receipt",
    "receptionist",
    "recipe",
    "recite",
    "recognition",
    "recreation",
    "recycle",
    "reference",
    "reform",
    "refresh",
    "regardless",
    "register",
    "reject",
    "relate",
    "relay",
    "release",
    "relevant",
    "reliable",
    "rely",
    "remarkable",
    "remote",
    "rent",
    "representative",
    "reputation",
    "rescue",
    "reserve",
    "resident",
    "resign",
    "resistance",
    "resolution",
    "resolve",
    "respective",
    "responsibility",
    "restore",
    "restrict",
    "reward",
    "rhyme",
    "riddle",
    "rigid",
    "ripe",
    "roast",
    "rocket",
    "roof",
    "root",
    "route",
    "routine",
    "royal",
    "rubber",
    "rude",
    "rugby",
    "ruin",
    "rural",
    "sail",
    "salary",
    "salesman",
    "saleswoman",
    "salty",
    "sample",
    "satellite",
    "saucer",
    "sausage",
    "saving",
    "saying",
    "scholarship",
    "scientific",
    "scream",
    "sculpture",
    "secondary",
    "secure",
    "security",
    "seed",
    "seize",
    "sensitive",
    "servant",
    "session",
    "setting",
    "severe",
    "sew",
    "shade",
    "shadow",
    "shark",
    "shave",
    "shelf",
    "shelter",
    "shift",
    "shore",
    "shortage",
    "sincerely",
    "sink",
    "skateboard",
    "skip",
    "slice",
    "slip",
    "sneeze",
    "socialist",
    "soil",
    "solar",
    "soldier",
    "solid",
    "somewhat",
    "sorrow",
    "soul",
    "sour",
    "sow",
    "specialist",
    "species",
    "splendid",
    "sponsor",
    "spot",
    "spy",
    "stability",
    "stadium",
    "stare",
    "starve",
    "statistic",
    "statue",
    "steak",
    "steam",
    "steel",
    "stimulate",
    "straightforward",
    "strait",
    "stream",
    "strengthen",
    "stretch",
    "strike",
    "string",
    "structure",
    "subjective",
    "submit",
    "subscribe",
    "subsequent",
    "substance",
    "substantial",
    "suburb",
    "suit",
    "suitable",
    "sum",
    "superb",
    "superior",
    "surgeon",
    "surgery",
    "surrounding",
    "suspect",
    "suspend",
    "sustain",
    "sweep",
    "swing",
    "switch",
    "symbol",
    "sympathy",
    "symphony",
    "tablet",
    "tackle",
    "tailor",
    "tale",
    "tank",
    "tax",
    "teapot",
    "telescope",
    "temple",
    "temporary",
    "tendency",
    "tension",
    "territory",
    "theft",
    "theory",
    "thinking",
    "thorough",
    "threat",
    "threaten",
    "thunder",
    "tight",
    "toast",
    "tobacco",
    "tolerate",
    "tone",
    "tournament",
    "towel",
    "transform",
    "trap",
    "trend",
    "trial",
    "trick",
    "trunk",
    "tube",
    "tune",
    "twin",
    "typhoon",
    "ultimately",
    "uniform",
    "universe",
    "unusual",
    "upset",
    "urban",
    "urge",
    "urgent",
    "valley",
    "variation",
    "vary",
    "vase",
    "vast",
    "version",
    "victim",
    "violence",
    "virtual",
    "virtue",
    "virus",
    "visible",
    "vision",
    "visual",
    "vital",
    "vivid",
    "vocabulary",
    "volume",
    "vote",
    "wage",
    "waist",
    "wander",
    "ward",
    "warning",
    "washroom",
    "wave",
    "weapon",
    "weed",
    "weekly",
    "weep",
    "welfare",
    "wheat",
    "whisper",
    "widespread",
    "wire",
    "wisdom",
    "withdraw",
    "witness",
    "wool",
    "worthwhile",
    "worthy",
    "wrap",
    "wrestle",
    "wrinkle",
    "wrist"
  ],
  "senior_match_forms": [
    "a.m.",
    "abandon",
    "abnormal",
    "aboard",
    "absence",
    "absolutely",
    "absorb",
    "abstract",
    "abuse",
    "academic",
    "accent",
    "access",
    "accident",
    "accommodation",
    "accompany",
    "account",
    "accurate",
    "accuse",
    "ache",
    "achievement",
    "acid",
    "acknowledge",
    "acquire",
    "actually",
    "ad",
    "adapt",
    "adaptation",
    "addict",
    "addition",
    "adjust",
    "administration",
    "admire",
    "admit",
    "adopt",
    "adult",
    "advance",
    "adventure",
    "advertise",
    "advertisement",
    "advocate",
    "affair",
    "affect",
    "afterward",
    "agency",
    "agenda",
    "agriculture",
    "ahead",
    "aid",
    "aim",
    "airline",
    "alarm",
    "alcohol",
    "alongside",
    "alternative",
    "altogether",
    "amateur",
    "amazing",
    "ambition",
    "ambitious",
    "ambulance",
    "amount",
    "amuse",
    "analyse",
    "analyze",
    "ancestor",
    "anger",
    "angle",
    "ankle",
    "announce",
    "annoy",
    "annual",
    "anticipate",
    "antique",
    "anxiety",
    "anxious",
    "anyhow",
    "apart",
    "apartment",
    "apologize",
    "appeal",
    "appetite",
    "applaud",
    "applicant",
    "application",
    "apply",
    "appointment",
    "appreciate",
    "approach",
    "appropriate",
    "approve",
    "arch",
    "architect",
    "argue",
    "arise",
    "arrangement",
    "arrest",
    "arrow",
    "artificial",
    "ashamed",
    "aside",
    "aspect",
    "assess",
    "assign",
    "assistant",
    "association",
    "assume",
    "assumption",
    "astonish",
    "astronaut",
    "astronomer",
    "athlete",
    "atlantic",
    "atmosphere",
    "attach",
    "attack",
    "attain",
    "attempt",
    "attitude",
    "attract",
    "audience",
    "author",
    "authority",
    "automatic",
    "autonomous",
    "available",
    "average",
    "award",
    "aware",
    "awesome",
    "awkward",
    "backward",
    "bacon",
    "badminton",
    "bakery",
    "balance",
    "ballet",
    "ban",
    "band",
    "bar",
    "barbecue",
    "barely",
    "bark",
    "barrier",
    "base",
    "basin",
    "basis",
    "bat",
    "bath",
    "battery",
    "battle",
    "bay",
    "bc",
    "beard",
    "beauty",
    "beer",
    "behalf",
    "behave",
    "behavior",
    "behaviour",
    "being",
    "belief",
    "belong",
    "belt",
    "bend",
    "beneath",
    "benefit",
    "bet",
    "beyond",
    "billion",
    "biology",
    "bite",
    "bitter",
    "blame",
    "blank",
    "blanket",
    "bleed",
    "bless",
    "boil",
    "bomb",
    "bond",
    "bone",
    "bonus",
    "boost",
    "boot",
    "border",
    "botanical",
    "bother",
    "bounce",
    "bound",
    "boundary",
    "bow",
    "bowling",
    "boxing",
    "branch",
    "breast",
    "breath",
    "breathe",
    "brick",
    "bride",
    "bridegroom",
    "brief",
    "brilliant",
    "broad",
    "broadcast",
    "brochure",
    "budget",
    "buffet",
    "bunch",
    "bury",
    "butcher",
    "butter",
    "button",
    "cabbage",
    "cafe",
    "cafeteria",
    "cage",
    "calculate",
    "calm",
    "calorie",
    "camel",
    "campaign",
    "campus",
    "canal",
    "cancer",
    "candidate",
    "canteen",
    "capable",
    "capacity",
    "capsule",
    "captain",
    "carbon",
    "career",
    "carpet",
    "carve",
    "case",
    "cash",
    "cast",
    "castle",
    "category",
    "cattle",
    "cave",
    "cease",
    "ceiling",
    "cell",
    "centimetre",
    "certificate",
    "chain",
    "chairman",
    "chairwoman",
    "challenge",
    "champion",
    "channel",
    "chaos",
    "chapter",
    "character",
    "characteristic",
    "charge",
    "charity",
    "chart",
    "chat",
    "cheat",
    "cheek",
    "cheese",
    "chef",
    "chemical",
    "chemist",
    "chest",
    "chew",
    "chief",
    "china",
    "choke",
    "chorus",
    "church",
    "cigarette",
    "circuit",
    "circumstance",
    "circus",
    "cite",
    "citizen",
    "civil",
    "civilian",
    "civilization",
    "claim",
    "clap",
    "clarify",
    "classic",
    "clay",
    "clerk",
    "click",
    "client",
    "climate",
    "clinic",
    "clone",
    "cloth",
    "clue",
    "collapse",
    "collar",
    "collection",
    "column",
    "combine",
    "comedy",
