{
  "source": {
    "pdf": "official_english_curriculum_2022.pdf",
    "official_release_date": "2022-04-21",
    "notes": [
      "Primary/junior matching is derived from the official 2022 compulsory education English curriculum standard appendix.",
      "Primary matching includes explicit supplements for number/month/week vocabulary because these are listed separately in the official appendix notes and are fundamental to the project classification goal.",
      "Later buckets such as senior/CET/TOEFL/GRE remain handled by the existing public wordlists in the build script."
    ]
  },
  "level2_entries": [
    "a/an",
    "about",
    "after",
    "afternoon",
    "again",
    "age",
    "ago",
    "air",
    "all",
    "also",
    "always",
    "and",
    "angry",
    "animal",
    "answer",
    "any",
    "apple",
    "arm",
    "art",
    "ask",
    "astronaut",
    "at",
    "aunt",
    "autumn",
    "baby",
    "back",
    "bad",
    "bag",
    "ball",
    "banana",
    "basketball",
    "be (am, is, are)",
    "beach",
    "bear",
    "beautiful",
    "because",
    "bed",
    "bee",
    "before",
    "begin",
    "behind",
    "beside",
    "best",
    "between",
    "big",
    "bike(=bicycle)",
    "bird",
    "birthday",
    "black",
    "blackboard",
    "blue",
    "boat",
    "body",
    "book",
    "box",
    "boy",
    "bread",
    "breakfast",
    "bring",
    "brother",
    "brown",
    "bus",
    "busy",
    "but",
    "buy",
    "by",
    "cake",
    "call",
    "can",
    "candle",
    "candy",
    "cap",
    "car",
    "card",
    "careful",
    "cat",
    "catch",
    "chair",
    "chicken",
    "child (pl. children)",
    "China",
    "Chinese",
    "chore",
    "cinema",
    "city",
    "class",
    "classroom",
    "clean",
    "clever",
    "clock",
    "close",
    "clothes",
    "cloudy",
    "coat",
    "cold",
    "colour(AmE color)",
    "come",
    "computer",
    "cook",
    "cool",
    "cousin",
    "cow",
    "cry",
    "cup",
    "cut",
    "cute",
    "dance",
    "day",
    "dear",
    "desk",
    "difficult",
    "dinner",
    "dirty",
    "do",
    "doctor",
    "dog",
    "doll",
    "door",
    "down",
    "draw",
    "dress",
    "drink",
    "driver",
    "duck",
    "ear",
    "early",
    "earth",
    "easy",
    "eat",
    "egg",
    "elephant",
    "email",
    "English",
    "evening",
    "every",
    "excited",
    "exercise",
    "eye",
    "face",
    "family",
    "famous",
    "fan",
    "far",
    "farm",
    "farmer",
    "fast",
    "father (dad)",
    "favourite(AmE favorite)",
    "feel",
    "film",
    "find",
    "fine",
    "fire",
    "fish",
    "floor",
    "flower",
    "food",
    "foot(pl. feet)",
    "football",
    "for",
    "fee",
    "friend",
    "from",
    "front",
    "fruit",
    "game",
    "garden",
    "get",
    "gift",
    "girl",
    "give",
    "glass",
    "go",
    "0od",
    "goodbye(bye)",
    "grandfather(grandpa)",
    "grandmother(grandma)",
    "grape",
    "grass",
    "great",
    "green",
    "hair",
    "half",
    "hand",
    "happy",
    "hard",
    "have (has)",
    "he",
    "head",
    "healthy",
    "hear",
    "heavy",
    "hello",
    "help",
    "helpful",
    "her",
    "here",
    "hi",
    "hill",
    "him",
    "his",
    "holiday",
    "home",
    "hometown",
    "horse",
    "hospital",
    "hot",
    "hour",
    "house",
    "how",
    "hungry",
    "hurry",
    "hurt",
    "ice",
    "ice cream",
    "idea",
    "in",
    "interesting",
    "Internet",
    "it",
    "its",
    "job",
    "juice",
    "jump",
    "keep",
    "kid",
    "kind",
    "kitchen",
    "kite",
    "know",
    "lake",
    "last",
    "late",
    "learn",
    "left",
    "leg",
    "lesson",
    "let",
    "lttr",
    "library",
    "light",
    "like",
    "lion",
    "listen",
    "litle",
    "live",
    "long",
    "look",
    "lot",
    "love",
    "lovely",
    "lunch",
    "make",
    "man (pl. men)",
    "many",
    "map",
    "maths(=mathematics, AmE math)",
    "may",
    "me",
    "meat",
    "meet",
    "middle",
    "milk",
    "minute",
    "Miss",
    "money",
    "monkey",
    "month",
    "moon",
    "morning",
    "mother(mum AmE mom)",
    "mouse (pl. mice)",
    "mouth",
    "move",
    "Mr(AmE Mr.)",
    "Mrs(AmE Mrs.)",
    "Ms(AmE Ms.)",
    "much",
    "music",
    "must",
    "my",
    "name",
    "near",
    "ath)",
    "never",
    "new",
    "next",
    "nice",
    "night",
    "no",
    "noodle",
    "nose",
    "not",
    "now",
    "nurse",
    "o'clock",
    "of",
    "offer",
    "often",
    "OK",
    "old",
    "on",
    "open",
    "or",
    "orange",
    "our",
    "out",
    "over",
    "pair",
    "panda",
    "paper",
    "parent",
    "park",
    "party",
    "PE(=physical education)",
    "pen",
    "pencil",
    "people",
    "pet",
    "phone",
    "photo(=photograph)",
    "piano",
    "picture",
    "pig",
    "ping-pong",
    "pink",
    "place",
    "plane",
    "plant",
    "play",
    "playground",
    "please",
    "police",
    "potato",
    "put",
    "question",
    "quiet",
    "rabbit",
    "rain",
    "read",
    "red",
    "rice",
    "right",
    "river",
    "robot",
    "room",
    "ruler",
    "run",
    "sad",
    "safe",
    "say",
    "school",
    "schoolbag",
    "science",
    "sea",
    "season",
    "see",
    "sell",
    "share",
    "she",
    "sheep (pl. sheep)",
    "ship",
    "shirt",
    "shoe",
    "shop",
    "short",
    "shorts",
    "should",
    "show",
    "sing",
    "sister",
    "sit",
    "skirt",
    "sleep",
    "slow",
    "small",
    "snow",
    "so",
    "sock",
    "some",
    "sometimes",
    "song",
    "sorry",
    "soup",
    "space",
    "speak",
    "sport",
    "spring",
    "stand",
    "star",
    "stop",
    "story",
    "street",
    "strong",
    "student",
    "study",
    "subject",
    "summer",
    "sun",
    "sunny",
    "supermarket",
    "sure",
    "sweater",
    "sweep",
    "swim",
    "table",
    "tail",
    "take",
    "talk",
    "tall",
    "taxi",
    "tea",
    "teacher",
    "tell",
    "thank",
    "that",
    "the",
    "their",
    "them",
    "then",
    "there",
    "these",
    "they",
    "thin",
    "think",
    "this",
    "those",
    "tidy",
    "tiger",
    "time",
    "tired",
    "to",
    "today",
    "toilet",
    "tomato",
    "tomorrow",
    "too",
    "top",
    "toy",
    "train",
    "travel",
    "tree",
    "trousers",
    "try",
    "turn",
    "TV (=television)",
    "umbrella",
    "uncle",
    "under",
    "up",
    "us",
    "use",
    "vegetable",
    "very",
    "visit",
    "w",
    "wait",
    "wake",
    "walk",
    "wall",
    "want",
    "warm",
    "wash",
    "watch",
    "water",
    "way",
    "we",
    "wear",
    "weather",
    "week",
    "welcome",
    "well",
    "what",
    "when",
    "where",
    "which",
    "white",
    "who",
    "whose",
    "why",
    "will",
    "win",
    "window",
    "windy",
    "winter",
    "wish",
    "with",
    "woman(pl. women)",
    "wonderful",
    "word",
    "work",
    "worker",
    "world",
    "worry",
    "write",
    "wrong",
    "year",
    "yellow",
    "yes",
    "yesterday",
    "you",
    "young",
    "your",
    "zero",
    "one",
    "two",
    "three",
    "four",
    "five",
    "six",
    "seven",
    "eight",
    "nine",
    "ten",
    "eleven",
    "twelve",
    "thirteen",
    "fourteen",
    "fifteen",
    "sixteen",
    "seventeen",
    "eighteen",
    "nineteen",
    "twenty",
    "thirty",
    "forty",
    "fifty",
    "sixty",
    "seventy",
    "eighty",
    "ninety",
    "hundred",
    "thousand",
    "million",
    "first",
    "second",
    "third",
    "fourth",
    "fifth",
    "sixth",
    "seventh",
    "eighth",
    "ninth",
    "tenth",
    "eleventh",
    "twelfth",
    "thirteenth",
    "fourteenth",
    "fifteenth",
    "sixteenth",
    "seventeenth",
    "eighteenth",
    "nineteenth",
    "twentieth",
    "thirtieth",
    "fortieth",
    "fiftieth",
    "sixtieth",
    "seventieth",
    "eightieth",
    "ninetieth",
    "hundredth",
    "January",
    "February",
    "March",
    "April",
    "May",
    "June",
    "July",
    "August",
    "September",
    "October",
    "November",
    "December",
    "Monday",
    "Tuesday",
    "Wednesday",
    "Thursday",
    "Friday",
    "Saturday",
    "Sunday"
  ],
  "level2_match_forms": [
    "a",
    "about",
    "after",
    "afternoon",
    "again",
    "age",
    "ago",
    "air",
    "all",
    "also",
    "always",
    "am",
    "and",
    "angry",
    "animal",
    "answer",
    "any",
    "apple",
    "april",
    "are",
    "arm",
    "art",
    "ask",
    "astronaut",
    "at",
    "august",
    "aunt",
    "autumn",
    "baby",
    "back",
    "bad",
    "bag",
    "ball",
    "banana",
    "basketball",
    "be",
    "beach",
    "bear",
    "beautiful",
    "because",
    "bed",
    "bee",
    "before",
    "begin",
    "behind",
    "beside",
    "best",
    "between",
    "bicycle",
    "big",
    "bike",
    "bird",
    "birthday",
    "black",
    "blackboard",
    "blue",
    "boat",
    "body",
    "book",
    "box",
    "boy",
    "bread",
    "breakfast",
    "bring",
    "brother",
    "brown",
    "bus",
    "busy",
    "but",
    "buy",
    "by",
    "bye",
    "cake",
    "call",
    "can",
    "candle",
    "candy",
    "cap",
    "car",
    "card",
    "careful",
    "cat",
    "catch",
    "chair",
    "chicken",
    "child",
    "china",
    "chinese",
    "cinema",
    "city",
    "class",
    "classroom",
    "clean",
    "clever",
    "clock",
    "close",
    "clothes",
    "cloudy",
    "coat",
    "cold",
    "color",
    "colour",
    "come",
    "computer",
    "cook",
    "cool",
    "core",
    "cousin",
    "cow",
    "cry",
    "cup",
    "cut",
    "cute",
    "dad",
    "dance",
    "day",
    "dear",
    "december",
    "desk",
    "difficult",
    "dinner",
    "dirty",
    "do",
    "doctor",
    "dog",
    "doll",
    "door",
    "down",
    "draw",
    "dress",
    "drink",
    "driver",
    "duck",
    "ear",
    "early",
    "earth",
    "easy",
    "eat",
    "education",
    "egg",
    "eight",
    "eighteen",
    "eighth",
    "eighty",
    "elephant",
    "eleven",
    "eleventh",
    "english",
    "evening",
    "every",
    "excite",
    "exercise",
    "eye",
    "face",
    "family",
    "famous",
    "fan",
    "far",
    "farm",
    "farmer",
    "fast",
    "father",
    "favourite",
    "february",
    "fee",
    "feel",
    "fifteen",
    "fifth",
    "fifty",
    "film",
    "find",
    "fine",
    "fire",
    "first",
    "fish",
    "five",
    "fleet",
    "floor",
    "flower",
    "food",
    "foot",
    "football",
    "for",
    "forty",
    "four",
    "fourteen",
    "fourth",
    "friday",
    "friend",
    "from",
    "front",
    "fruit",
    "game",
    "garden",
    "get",
    "gift",
    "girl",
    "give",
    "glass",
    "go",
    "grandfather",
    "grandma",
    "grandmother",
    "grandpa",
    "grape",
    "grass",
    "great",
    "green",
    "hair",
    "half",
    "hand",
    "happy",
    "hard",
    "have",
    "he",
    "head",
    "healthy",
    "hear",
    "heavy",
    "hello",
    "help",
    "helpful",
    "her",
    "here",
    "hi",
    "hill",
    "him",
    "his",
    "holiday",
    "home",
    "hometown",
    "horse",
    "hospital",
    "hot",
    "hour",
    "house",
    "how",
    "hundred",
    "hungry",
    "hurry",
    "hurt",
    "ice",
    "idea",
    "in",
    "interesting",
    "internet",
    "it",
    "its",
    "january",
    "job",
    "juice",
    "july",
    "jump",
    "june",
    "keep",
    "kid",
    "kind",
    "kitchen",
    "kite",
    "know",
    "lake",
    "last",
    "late",
    "learn",
    "left",
    "leg",
    "lesson",
    "let",
    "library",
    "light",
    "like",
    "lion",
    "listen",
    "little",
    "live",
    "long",
    "look",
    "lot",
    "love",
    "lovely",
    "lunch",
    "make",
    "man",
    "many",
    "map",
    "march",
    "math",
    "mathematics",
    "maths",
    "may",
    "me",
    "mean",
    "meat",
    "meet",
    "mend",
    "menu",
    "middle",
    "milk",
    "million",
    "minute",
    "miss",
    "mom",
    "monday",
    "money",
    "monkey",
    "month",
    "moon",
    "morning",
    "mother",
    "mouse",
    "mouth",
    "move",
    "mr",
    "mr.",
    "mrs",
    "mrs.",
    "ms",
    "ms.",
    "much",
    "music",
    "must",
    "my",
    "name",
    "near",
    "never",
    "new",
    "next",
    "nice",
    "night",
    "nine",
    "nineteen",
    "ninety",
    "ninth",
    "no",
    "noodle",
    "nose",
    "not",
    "november",
    "now",
    "nurse",
    "october",
    "of",
    "offer",
    "often",
    "ok",
    "old",
    "on",
    "one",
    "open",
    "or",
    "orange",
    "our",
    "out",
    "over",
    "pair",
    "panda",
    "paper",
    "parent",
    "park",
    "party",
    "pen",
    "pencil",
    "people",
    "pet",
    "phone",
    "photo",
    "photograph",
    "physical",
    "piano",
    "picture",
    "pig",
    "pink",
    "place",
    "plane",
    "plant",
    "play",
    "playground",
    "please",
    "police",
    "potato",
    "put",
    "question",
    "quiet",
    "rabbit",
    "rain",
    "read",
    "red",
    "rice",
    "right",
    "river",
    "robot",
    "room",
    "ruler",
    "run",
    "sad",
    "safe",
    "saturday",
    "say",
    "school",
    "schoolbag",
    "science",
    "sea",
    "season",
    "second",
    "see",
    "sell",
    "september",
    "seven",
    "seventeen",
    "seventh",
    "seventy",
    "share",
    "she",
    "sheep",
    "ship",
    "shirt",
    "shoe",
    "shop",
    "short",
    "shorts",
    "should",
    "show",
    "sing",
    "sister",
    "sit",
    "six",
    "sixteen",
    "sixteenth",
    "sixth",
    "sixty",
    "skirt",
    "sleep",
    "slow",
    "small",
    "snow",
    "so",
    "sock",
    "some",
    "sometimes",
    "song",
    "sorry",
    "soup",
    "space",
    "speak",
    "sport",
    "spring",
    "stair",
    "stand",
    "stare",
    "start",
    "stop",
    "story",
    "street",
    "strong",
    "student",
    "study",
    "subject",
    "sun",
    "sunday",
    "sunny",
    "supermarket",
    "sure",
    "sweater",
    "sweep",
    "swim",
    "table",
    "tail",
    "take",
    "talk",
    "tall",
    "taxi",
    "tea",
    "teacher",
    "television",
    "tell",
    "ten",
    "tenth",
    "thank",
    "that",
    "the",
    "their",
    "them",
    "then",
    "there",
    "these",
    "they",
    "thin",
    "think",
    "third",
    "thirteen",
    "thirty",
    "this",
    "those",
    "thousand",
    "three",
    "thursday",
    "tidy",
    "tiger",
    "time",
    "tired",
    "to",
    "today",
    "toilet",
    "tomato",
    "tomorrow",
    "too",
    "top",
    "toy",
    "train",
    "traveler",
    "tree",
    "trousers",
    "try",
    "tuesday",
    "turn",
    "tv",
    "twelfth",
    "twelve",
    "twentieth",
    "twenty",
    "two",
    "umbrella",
    "uncle",
    "under",
    "up",
    "us",
    "use",
    "vegetable",
    "very",
    "visit",
    "wait",
    "wake",
    "walk",
    "wall",
    "want",
    "warm",
    "wash",
    "watch",
    "water",
    "way",
    "we",
    "wear",
    "weather",
    "week",
    "welcome",
    "well",
    "what",
    "when",
    "where",
    "which",
    "white",
    "who",
    "whose",
    "why",
    "will",
    "win",
    "window",
    "windy",
    "winter",
    "wish",
    "with",
    "woman",
    "wonderful",
    "word",
    "work",
    "worker",
    "world",
    "worry",
    "write",
    "wrong",
    "year",
    "yellow",
    "yes",
    "yesterday",
    "you",
    "young",
    "your",
    "zero"
  ],
  "level3_entries": [
    "标注,如 child (pl. childre",
    "tion)",
    "a/ an",
    "ability",
    "able",
    "、be(am, is, are)、PE(=physi",
    "about",
    "above",
    "abroad",
    "absent",
    "accept",
    "accident",
    "according (to)",
    "account",
    "ache",
    "achieve",
    "across",
    "act",
    "action",
    "active",
    "activity",
    "actor/actress",
    "actually",
    "ad(=advertisement)",
    "add",
    "address",
    "admire",
    "adult",
    "advantage",
    "advice",
    "advise",
    "afford",
    "afraid",
    "after",
    "afternoon*",
    "again",
    "against",
    "age",
    "ago *",
    "agree",
    "ahead",
    "AI(=artificial intelligence)",
    "aid",
    "aim",
    "air*",
    "airport",
    "alarm",
    "alive",
    "allow",
    "almost",
    "alone",
    "along",
    "aloud",
    "already",
    "also*",
    "although",
    "always",
    "a.m.",
    "amazing",
    "among",
    "ancient",
    "and*",
    "angry",
    "animal",
    "another",
    "answer",
    "ant",
    "any *",
    "anybody /anyone",
    "anything",
    "anyway",
    "anywhere",
    "apartment",
    "app (=application)",
    "appear",
    "apple*",
    "area",
    "argue",
    "arm",
    "army",
    "around",
    "arrive",
    "art*",
    "article",
    "artist",
    "as",
    "ask*",
    "asleep",
    "astronaut",
    "at*",
    "athlete",
    "attack",
    "attend",
    "attention",
    "aunt",
    "autumn",
    "average",
    "avoid",
    "awake",
    "award",
    "aware",
    "away",
    "awful",
    "B",
    "baby",
    "back*",
    "background",
    "bad",
    "badminton",
    "bag",
    "balance",
    "ball",
    "balloon",
    "bamboo",
    "banana",
    "band",
    "bank",
    "baseball",
    "basic",
    "basket",
    "basketball",
    "bat",
    "bath",
    "bathroom",
    "be(am, is, are)",
    "beach",
    "bean",
    "bear*",
    "beat",
    "beautiful*",
    "because",
    "become",
    "bed*",
    "bedroom",
    "bee",
    "beef",
    "before",
    "begin",
    "behave",
    "behind",
    "believe",
    "bell",
    "belong",
    "below",
    "belt",
    "benefit",
    "beside",
    "best",
    "better",
    "between*",
    "big",
    "bike (=bicycle)",
    "bill",
    "bin",
    "biology",
    "bird*",
    "birth",
    "birthday",
    "biscuit",
    "bit",
    "black*",
    "blackboard",
    "bleed",
    "blind",
    "block",
    "blood",
    "blouse",
    "blow",
    "blue*",
    "board",
    "boat",
    "body*",
    "boil",
    "book*",
    "boring",
    "born",
    "borrow",
    "boSs",
    "both",
    "bottle",
    "bottom",
    "bowl",
    "box*",
    "boy",
    "brain",
    "brave",
    "bread",
    "break",
    "breakfast",
    "breath",
    "bridge",
    "bright",
    "bring",
    "brother",
    "brown*",
    "brush",
    "budget",
    "build",
    "building",
    "busy",
    "burn",
    "bus*",
    "business",
    "busy*",
    "but*",
    "butter",
    "butterfly",
    "by",
    "C",
    "cabbage",
    "cake",
    "calendar",
    "calm",
    "camera",
    "camp",
    "can*",
    "cancel",
    "cancer",
    "candle",
    "candy",
    "cap",
    "capital",
    "car*",
    "card*",
    "care",
    "careful",
    "careless",
    "carrot",
    "carry",
    "cartoon",
    "case",
    "Cash",
    "cat",
    "catch",
    "cause",
    "celebrate",
    "cent",
    "central",
    "centre(AmE center)",
    "century",
    "curtain",
    "chair",
    "chalk",
    "challenge",
    "champion",
    "chance",
    "change",
    "character",
    "characteristic",
    "charity",
    "chat",
    "cheap",
    "cheat",
    "check",
    "cheer",
    "cheese",
    "chemistry",
    "chess",
    "chicken*",
    "child (pl. children)*",
    "China*",
    "Chinese",
    "chip",
    "chocolate",
    "choice",
    "choose",
    "chopsticks",
    "chore*",
    "Christmas",
    "cinema*",
    "circle",
    "citizen",
    "city",
    "class",
    "classic",
    "classmate",
    "classoom*",
    "clean*",
    "clear",
    "clever",
    "click",
    "climate",
    "climb",
    "clock*",
    "close",
    "clothes",
    "cloud",
    "cloudy",
    "club",
    "Coach",
    "COast",
    "COat",
    "coffee",
    "coin",
    "cold",
    "collect",
    "college",
    "ccoolmoeu\"r(AmE color)",
    "comfortable",
    "common",
    "communicate",
    "community",
    "company",
    "compare",
    "compete",
    "complete",
    "computer*",
    "concert",
    "condition",
    "confidence",
    "congratulation",
    "connect",
    "consider",
    "continue",
    "Control",
    "convenient",
    "conversation",
    "Cook*",
    "cookie",
    "cool",
    "cooperate",
    "copy",
    "corn",
    "corner",
    "correct",
    "cost",
    "cotton",
    "cough",
    "could",
    "count",
    "country",
    "countryside",
    "couple",
    "courage",
    "course",
    "cousin *",
    "cover",
    "Cow*",
    "crazy",
    "create",
    "creative",
    "cross",
    "crowded",
    "cry*",
    "cucumber",
    "culture",
    "cup",
    "curious",
    "customer",
    "cut",
    "cute",
    "daily",
    "dance",
    "danger",
    "dangerous",
    "dark",
    "date",
    "daughter",
    "day*",
    "dead",
    "deaf",
    "deal",
    "dear*",
    "death",
    "decide",
    "deep",
    "degree",
    "delicious",
    "dentist",
    "depend",
    "describe",
    "desert",
    "design",
    "desk*",
    "develop",
    "dialogue(AmE dialog)",
    "diary",
    "dictionary",
    "die",
    "diet",
    "difference",
    "different",
    "difficult",
    "dig",
    "digital",
    "dining",
    "diner",
    "direct",
    "director",
    "dirty",
    "disappoint",
    "disaster",
    "discover",
    "discuss",
    "disease",
    "dish",
    "divide",
    "do",
    "doctor",
    "dog",
    "doll",
    "dollar",
    "donate",
    "door*",
    "double",
    "doubt",
    "down*",
    "download",
    "dragon",
    "drama",
    "draw*",
    "dream",
    "dress",
    "drink*",
    "drive",
    "driver",
    "drop",
    "dry",
    "duck",
    "dumpling",
    "during",
    "duty",
    "E",
    "each",
    "cagle",
    "ear*",
    "early",
    "earth",
    "earthquake",
    "east",
    "easy",
    "eat",
    "education",
    "effect",
    "effort",
    "egg*",
    "either",
    "elder",
    "electric",
    "electronic",
    "elephant",
    "else",
    "emergency",
    "emperor/empress",
    "empty",
    "encourage",
    "end",
    "enemy",
    "energetic",
    "energy",
    "engineer",
    "English",
    "enjoy",
    "enough",
    "enter",
    "environment",
    "era",
    "eraser",
    "especially",
    "even",
    "evening",
    "event",
    "ever",
    "every*",
    "everybody /everyone",
    "everyday",
    "everything",
    "everywhere",
    "exactly",
    "exam(=examination)",
    "example",
    "excellent",
    "except",
    "excited",
    "exciting",
    "excuse",
    "exercise",
    "expect",
    "expensive",
    "experience",
    "expert",
    "explain",
    "explore",
    "express",
    "eye*",
    "F",
    "face",
    "fact",
    "factory",
    "fail",
    "fair",
    "fall",
    "false",
    "familiar",
    "family",
    "famous",
    "fan*",
    "fantastic",
    "far",
    "farm",
    "farmer",
    "fashion",
    "fast",
    "fat",
    "father (dad) *",
    "favourite(AmE favorite)*",
    "fear",
    "feed",
    "eel",
    "feeling",
    "festival",
    "fever",
    "few",
    "field",
    "fight",
    "fim*",
    "final",
    "find",
    "fin",
    "finger",
    "finish",
    "fir",
    "fireman(pl. firemen)",
    "firework",
    "fish",
    "fit",
    "fix",
    "flag",
    "flat",
    "flood",
    "floor*",
    "flower",
    "fiu",
    "ny",
    "focus",
    "fog",
    "folk",
    "follow",
    "food *",
    "fool",
    "foot(pl. feet)*",
    "football",
    "for",
    "force",
    "foreign",
    "forest",
    "forever",
    "forget",
    "fork",
    "form",
    "forward",
    "found",
    "fox",
    "fre",
    "freeze",
    "fresh",
    "fridge(=refrigerator)",
    "friend*",
    "friendly",
    "friendship",
    "from",
    "front*",
    "fuit*",
    "fu",
    "fun",
    "funny",
    "future",
    "G",
    "game*",
    "garden",
    "gas",
    "gate",
    "general",
    "gentleman(pl. gentlemen)",
    "geography",
    "get*",
    "gif*",
    "giraffe",
    "ginl*",
    "give*",
    "glad",
    "glass",
    "glove",
    "glue",
    "8o*",
    "goal",
    "god",
    "gold",
    "good",
    "goodbye(bye)",
    "government",
    "grade",
    "graduate",
    "grammar",
    "grandfather(grandpa)",
    "grandmother(grandma)",
    "grape",
    "grass",
    "great",
    "green*",
    "greet",
    "grey(AmE gray)",
    "ground",
    "group",
    "grow",
    "guard",
    "guess",
    "guest",
    "guide",
    "guitar",
    "gun",
    "gym(=gymnasium)",
    "H",
    "habit",
    "hair",
    "half*",
    "hall",
    "hamburger",
    "hand",
    "handsome",
    "hang",
    "happen",
    "happy",
    "hard*",
    "hardly",
    "harm",
    "hat",
    "hate",
    "have (has)*",
    "he",
    "head*",
    "health",
    "healthy",
    "hear*",
    "heart",
    "heat",
    "heavy",
    "height",
    "hello",
    "helpful",
    "hen",
    "her*",
    "here",
    "hero",
    "hers",
    "herself",
    "hi*",
    "hide",
    "high",
    "hike",
    "him*",
    "himself",
    "his*",
    "history",
    "hit",
    "hobby",
    "hold",
    "hole",
    "holiday*",
    "home*",
    "hometown",
    "homework",
    "honest",
    "honey",
    "honour(AmE honor)",
    "hope",
    "horse*",
    "hospital*",
    "host/hostess",
    "hot*",
    "hotel",
    "hour*",
    "house*",
    "housework",
    "how*",
    "however",
    "hug",
    "huge",
    "human",
    "humour(AmE humor)",
    "hungry",
    "hunt",
    "hurry",
    "hurt",
    "husband",
    "I",
    "I*",
    "ice*",
    "ice cream",
    "idea*",
    "if",
    "i*",
    "illness",
    "imagine",
    "important",
    "impossible",
    "improve",
    "in*",
    "include",
    "increase",
    "industry",
    "influence",
    "information",
    "insect",
    "inside",
    "instead",
    "instruction",
    "instrument",
    "interest",
    "interesting",
    "international",
    "Internet",
    "interview",
    "into",
    "introduce",
    "invent",
    "invite",
    "island",
    "its*",
    "itself",
    "J",
    "jacket",
    "jeans",
    "job*",
    "jog",
    "join",
    "joke",
    "journey",
    "joy",
    "judge",
    "juice",
    "jump",
    "junior",
    "just",
    "K",
    "keep",
    "key",
    "keyboard",
    "kick",
    "kid*",
    "kill",
    "kilo(=kilogram)",
    "kilometre(AmE kilometer)",
    "kind*",
    "king",
    "kiss",
    "kitchen*",
    "kite",
    "knee",
    "knife(pl. knives)",
    "knock",
    "know",
    "knowledge",
    "kung fu",
    "L",
    "lab(=laboratory)",
    "lady",
    "lake",
    "lamp",
    "land",
    "landscape",
    "language",
    "lantern",
    "laptop",
    "large",
    "last",
    "late",
    "later",
    "laugh",
    "law",
    "lawyer",
    "lay",
    "lazy",
    "lead",
    "leaf(pl. leaves)",
    "lean*",
    "least",
    "leave",
    "left",
    "leg*",
    "lemon",
    "lend",
    "less",
    "lesson",
    "let",
    "letter",
    "level",
    "library",
    "lie",
    "life (pl. lives)",
    "lift",
    "light",
    "lightning",
    "like",
    "likely",
    "line",
    "lion*",
    "list",
    "listen*",
    "literature",
    "litter",
    "litle",
    "live*",
    "lively",
    "local",
    "lock",
    "lonely",
    "long",
    "look*",
    "lose",
    "loss",
    "lost",
    "lot",
    "loud",
    "love",
    "lovely",
    "low",
    "luck",
    "lunch*",
    "M",
    "machine",
    "mad",
    "madam",
    "magazine",
    "magic",
    "main",
    "make*",
    "mall",
    "man (pl. men)*",
    "manage",
    "manner",
    "many",
    "map",
    "mark",
    "market",
    "marry",
    "master",
    "match",
    "material",
    "maths(=mathematics, AmE math)",
    "matter",
    "may",
    "maybe",
    "me*",
    "meal",
    "mean",
    "meaning",
    "meat",
    "medal",
    "medical",
    "medicine",
    "medium(pl. media)",
    "meet",
    "meeting",
    "member",
    "mention",
    "menu",
    "mess",
    "message",
    "method",
    "metre(AmE meter)",
    "middle",
    "might",
    "mile",
    "milk*",
    "mind",
    "mine",
    "math)\"minute",
    "mirror",
    "miss",
    "Miss",
    "mistake",
    "mix",
    "mobile",
    "model",
    "modern",
    "moment",
    "money",
    "monkey",
    "month",
    "moon*",
    "more",
    "morning",
    "most",
    "mother(mum AmE mom)",
    "mountain",
    "mouse(pl. mice)",
    "mouth",
    "move*",
    "movie",
    "Mr(AmE Mr.)*",
    "Mrs(AmE Mrs.)*",
    "Ms(AmE Ms.)",
    "much*",
    "museum",
    "music*",
    "must",
    "mutton",
    "my*",
    "myself",
    "N",
    "name*",
    "narrow",
    "nation",
    "nature",
    "near*",
    "nearly",
    "necessary",
    "neck",
    "need",
    "negative",
    "neighbour(AmE neighbor)",
    "neither",
    "nervous",
    "never*",
    "new*",
    "news",
    "newspaper",
    "next",
    "nice",
    "night*",
    "no*",
    "nobody",
    "nod",
    "noise",
    "none",
    "noodle*",
    "noon",
    "nor",
    "normal",
    "north",
    "nose*",
    "not*",
    "note",
    "notebook",
    "nothing",
    "notice",
    "novel",
    "now*",
    "number",
    "nurse",
    "object",
    "ocean",
    "o'clock",
    "of",
    "off",
    "offer",
    "office",
    "officer",
    "often",
    "oil",
    "OK*",
    "old*",
    "Olympic",
    "on*",
    "once",
    "onion",
    "online",
    "only",
    "open*",
    "opera",
    "operate",
    "opinion",
    "opposite",
    "or*",
    "orange",
    "order",
    "organise (AmE organize)",
    "other",
    "our*",
    "ours",
    "ourselves",
    "out\"*",
    "outside",
    "oven",
    "over",
    "own",
    "P",
    "pack",
    "packet",
    "page",
    "pain",
    "paint",
    "pai*",
    "palace",
    "pale",
    "pancake",
    "panda",
    "paper*",
    "paragraph",
    "pardon",
    "parent*",
    "park*",
    "part",
    "partner",
    "party",
    "pass",
    "passage",
    "passenger",
    "passport",
    "past",
    "patient",
    "pay",
    "PE(=physical education)",
    "peace",
    "pear",
    "Den",
    "pencil",
    "penguin",
    "people",
    "pepper",
    "per cent(AmE percent)",
    "perfect",
    "perform",
    "perhaps",
    "period",
    "person",
    "personal",
    "pet",
    "phone",
    "photo(=photograph)",
    "physics",
    "piano*",
    "pick",
    "picnic",
    "picture",
    "pie",
    "piece",
    "ig*",
    "pilot",
    "ping-pong",
    "pink*",
    "pioneer",
    "pity",
    "pizza",
    "plae",
    "plan",
    "plane",
    "planet",
    "plant",
    "plastic",
    "plate",
    "play",
    "playground*",
    "please",
    "pleasure",
    "plenty",
    "p.m.",
    "pocket",
    "poem",
    "poet",
    "point",
    "police*",
    "policeman/policewoman (p",
    "policemen/policewomen",
    "polite",
    "pollute",
    "pool",
    "poor",
    "popular",
    "population",
    "pork",
    "porridge",
    "position",
    "positive",
    "possible",
    "pOst",
    "postcard",
    "postman(pl. postmen)",
    "Pot",
    "potato",
    "pound",
    "pour",
    "power",
    "practice",
    "praise",
    "prefer",
    "prepare",
    "present",
    "president",
    "pressure",
    "pretty",
    "price",
    "pride",
    "primary",
    "prince/princess",
    "print",
    "private",
    "prize",
    "probably",
    "problem",
    "produce",
    "product",
    "programme(AmE program)",
    "progress",
    "project",
    "promise",
    "pronounce",
    "proper",
    "protect",
    "proud",
    "prove",
    "provide",
    "public",
    "publish",
    "pull",
    "punish",
    "purple",
    "purpose",
    "push",
    "put *",
    "quality",
    "quarter",
    "queen",
    "question",
    "quick",
    "quiet",
    "quite",
    "rabbit*",
    "race",
    "radio",
    "railway",
    "rain",
    "rainbow",
    "raise",
    "rapid",
    "rather",
    "reach",
    "read",
    "ready",
    "real",
    "realise(AmE realize)",
    "really",
    "reason",
    "receive",
    "recent",
    "recognise(AmE recognize)",
    "recommend",
    "record",
    "recycle",
    "red",
    "reduce",
    "refuse",
    "regret",
    "relationship",
    "relative",
    "relax",
    "remain",
    "remember",
    "remind",
    "repair",
    "repeat",
    "reply",
    "report",
    "require",
    "research",
    "respect",
    "responsible",
    "rest",
    "restaurant",
    "result",
    "return",
    "review",
    "rice*",
    "rich",
    "ride",
    "right",
    "ring",
    "rise",
    "risk",
    "river",
    "road",
    "robot*",
    "rock",
    "rocket",
    "role",
    "room*",
    "rope",
    "rose",
    "round",
    "row",
    "rubbish",
    "rule",
    "ruler",
    "run*",
    "rush",
    "Sad t",
    "safe",
    "safety",
    "salad",
    "sale",
    "salt",
    "same",
    "sand",
    "sandwich",
    "satisfy",
    "save",
    "say",
    "scare",
    "scarf",
    "school",
    "schoolbag",
    "science",
    "scientist",
    "scissors",
    "score",
    "sea",
    "search",
    "season*",
    "seat",
    "secret",
    "see",
    "seem",
    "seldom",
    "sell*",
    "send",
    "sense",
    "sentence",
    "separate",
    "serious",
    "serve",
    "service",
    "set",
    "several",
    "shake",
    "shall",
    "shame",
    "shape",
    "share",
    "shark",
    "she",
    "sheep(pl. sheep)",
    "shelf(pl. shelves)",
    "shine",
    "ship",
    "shirt",
    "shock",
    "shoe*",
    "shoot",
    "shop",
    "short",
    "shorts",
    "should",
    "shoulder",
    "shout",
    "show*",
    "shower",
    "shut",
    "shy",
    "sick",
    "side",
    "sign",
    "silent",
    "silk",
    "silly",
    "silver",
    "similar",
    "simple",
    "since",
    "sing",
    "single",
    "sir",
    "sister",
    "sit",
    "situation",
    "size",
    "skate",
    "ski",
    "skill",
    "skit",
    "sky",
    "sleep*",
    "slim",
    "slow*",
    "small*",
    "smart",
    "smell",
    "smile",
    "smoke",
    "smooth",
    "snack",
    "snake",
    "snow*",
    "so*",
    "social",
    "socialism",
    "society",
    "sock",
    "sofa",
    "soft",
    "soil",
    "soldier",
    "solve",
    "some",
    "somebody/someone",
    "something",
    "sometimes",
    "somewhere",
    "Son",
    "song",
    "soon",
    "sore",
    "sorry",
    "sound",
    "soup",
    "south",
    "space",
    "spare",
    "speak*",
    "special",
    "speech",
    "speed",
    "spell",
    "spend",
    "spirit",
    "spoon",
    "sport",
    "spread",
    "spring",
    "square",
    "stage",
    "stamp",
    "stand",
    "standard",
    "star*",
    "start",
    "state",
    "station",
    "stay",
    "steal",
    "step",
    "stick",
    "still",
    "stomach",
    "stone",
    "stop",
    "store",
    "storm",
    "story",
    "straight",
    "strange",
    "strawberry",
    "street*",
    "stress",
    "strict",
    "strong",
    "student",
    "study",
    "style",
    "subject",
    "succeed",
    "success",
    "such",
    "sudden",
    "suffer",
    "sugar",
    "suggest",
    "suit",
    "summer",
    "sun*",
    "sunny*",
    "supermarket",
    "support",
    "suppose",
    "sure*",
    "surface",
    "surprise",
    "survey",
    "survive",
    "sweater",
    "sweep",
    "sweet",
    "swim",
    "symbol",
    "table",
    "tail",
    "take",
    "talent",
    "talk*",
    "tall*",
    "tap",
    "tape",
    "task",
    "taste",
    "taxi*",
    "tea*",
    "teach",
    "teacher",
    "team",
    "teamwork",
    "technology",
    "teenage",
    "ten",
    "temperature",
    "tennis",
    "tent",
    "term",
    "terrible",
    "test",
    "text",
    "than",
    "thank*",
    "that",
    "the",
    "theatre(AmE theater)",
    "their",
    "theirs",
    "them",
    "themselves",
    "then*",
    "there*",
    "therefore",
    "these",
    "they",
    "thick",
    "thin*",
    "thing",
    "think*",
    "thirsty",
    "this",
    "those",
    "though",
    "thought",
    "throat",
    "through",
    "throw",
    "thunder",
    "ticket",
    "tidy",
    "tie",
    "tiger",
    "time*",
    "tiny",
    "tired",
    "to*",
    "today*",
    "tofu",
    "together",
    "toilt*",
    "tomato",
    "tomorrow",
    "ton",
    "tonight",
    "too*",
    "too",
    "tooth(pl. teeth)",
    "top",
    "total",
    "touch",
    "tour",
    "tourist",
    "towards(AmE toward)",
    "tower",
    "town",
    "toy*",
    "trade",
    "tradition",
    "traffic",
    "train",
    "training",
    "translate",
    "travel*",
    "treasure",
    "treat",
    "tree",
    "trip",
    "trouble",
    "trousers",
    "truck",
    "true",
    "trust",
    "truth",
    "ty*",
    "T-shirt",
    "turn",
    "TV(=television)*",
    "ugly",
    "umbrella",
    "uncle",
    "under*",
    "underground",
    "understand",
    "uniform",
    "unit",
    "universe",
    "university",
    "unless",
    "until(till)",
    "up*",
    "upOn",
    "us",
    "use*",
    "usual",
    "vacation",
    "value",
    "vegetable",
    "very*",
    "victory",
    "video",
    "view",
    "village",
    "violin",
    "virus",
    "visit",
    "voice",
    "volleyball",
    "voluntary",
    "volunteer",
    "vote",
    "wait",
    "wake",
    "walk*",
    "wallet",
    "want",
    "war",
    "warm*",
    "warn",
    "wash*",
    "waste",
    "watch",
    "water*",
    "watermelon",
    "wave",
    "way*",
    "we*",
    "weak",
    "wealth",
    "wear",
    "weather",
    "website",
    "week",
    "weekday",
    "weekend",
    "weigh",
    "weight",
    "welcome*",
    "wet*",
    "west",
    "wet",
    "whale",
    "what",
    "whatever",
    "wheel",
    "when",
    "whenever",
    "where*",
    "whether",
    "which",
    "while",
    "white",
    "who*",
    "whole",
    "whom",
    "whose*",
    "why",
    "wide",
    "wife(pl. wives)",
    "wild",
    "wil*",
    "win*",
    "wind",
    "window",
    "windy*",
    "wing",
    "winner",
    "winter",
    "wise",
    "wish*",
    "with*",
    "within",
    "without",
    "wolf(pl. wolves)",
    "woman(pl. women)",
    "wonder",
    "wonderful*",
    "wood",
    "word",
    "work",
    "worker",
    "world*",
    "worry",
    "worse",
    "worst",
    "worth",
    "would",
    "wound",
    "write",
    "wrong",
    "x",
    "X-ray",
    "yard",
    "year *",
    "yellow",
    "yes",
    "yesterday",
    "yet",
    "yogurt",
    "you*",
    "one",
    "two",
    "three",
    "four",
    "five",
    "six",
    "seven",
    "eight",
    "nine",
    "young",
    "your",
    "yours",
    "yourself(pl. yourselves)",
    "youth",
    "Zero",
    "z0o*",
    "first",
    "second",
    "third",
    "fourth",
    "fifth",
    "sixth",
    "seventh",
    "eighth",
    "ninth",
    "tenth",
    "eleven",
    "twelve",
    "thirteen",
    "fourteen",
    "fifteen",
    "sixteen",
    "seventeen",
    "eighteen",
    "nineteen",
    "twenty",
    "thirty",
    "forty",
    "fty",
    "sixty",
    "seventy",
    "eighty",
    "ninety",
    "hundred",
    "thousand",
    "million",
    "eleventh",
    "twelfth",
    "thirteenth",
    "fourteenth",
    "fifteenth",
    "sixteenth",
    "seventeenth",
    "eighteenth",
    "nineteenth",
    "twentieth",
    "thirtieth",
    "fortieth",
    "fiftieth",
    "sixtieth",
    "seventieth",
    "eightieth",
    "ninetieth",
    "hundredth",
    "January",
    "February",
    "March",
    "April",
    "May",
    "June",
    "July",
    "August",
    "September",
    "October",
    "November",
    "December",
    "n",
    "Africa",
    "America",
    "Antarctica n",
    "Asia",
    "Australia",
    "Monday",
    "Tuesday",
    "Wednesday",
    "Thursday",
    "Friday",
    "Saturday",
    "Sunday",
    "African n",
    "American n",
    "Asian",
    "Australian",
    "Britain",
    "Canada",
    "China",
    "England",
    "Europe",
    "France",
    "Germany",
    "India",
    "Italy n",
    "Japan n",
    "London",
    "New York",
    "New Zealand",
    "Paris",
    "Russia",
    "Singapore 净",
    "South Africa n",
    "The Atlantic Ocean",
    "n7",
    "The Indian Ocean",
    "The Pacific Ocean",
    "The United Kingdom",
    "(UKO",
    "The United States of n",
    "America (USA)",
    "British n",
    "Canadian n",
    "European n",
    "French n",
    "German n",
    "Indian n",
    "Italian",
    "Japanese 于",
    "New Zealander n",
    "Russian n",
    "Singaporean 于",
    "South African",
    "CPC(Communist Party",
    "PLA (People's Liberat",
    "PRC(People's Republic",
    "UN(United Nations)",
    "UNESCO (United Nations",
    "2zation)",
    "WHO (World Health Or",
    "WTO (World Trade Org",
    "Children's Day Mo",
    "Double Ninth Festival",
    "Dragon Boat Festival Mo",
    "Labour Day",
    "The",
    "Lantern Festival",
    "Mid-Autumn Festival The",
    "National Day Th",
    "New Year's Day The",
    "PLA Day",
    "Tia",
    "Spring Festival",
    "Teachers' Day",
    "Tomb-sweeping Day",
    "Women's Day",
    "China)",
    "n Army)",
    "f China)",
    "ucational, Scientific and Cultur",
    "ization)",
    "zation)",
    "t Huangshan Beijing opera",
    "nt Qomolangma opera)",
    "t Taishan Beijing roast",
    "hangjiang River hot pot",
    "e Yangtze River) lunar calendar",
    "reat Wall mooncake",
    "n paper-cut",
    "Palace Museum",
    "gipao",
    "ellow River",
    "anmen Square Spring Festival",
    "spring roll",
    "The Silk Road",
    "Traditional Ch",
    "Medicine",
    "zero",
    "fifty",
    "African",
    "American",
    "Antarctica",
    "British",
    "Canadian",
    "European",
    "French",
    "German",
    "Indian",
    "Italy",
    "Japan",
    "Japanese",
    "New Zealander",
    "Russian",
    "Singapore",
    "Singaporean",
    "South Africa",
    "UK",
    "The United States of America",
    "USA",
    "CPC",
    "PLA",
    "PRC",
    "UN",
    "UNESCO",
    "WHO",
    "WTO",
    "Children's Day",
    "Dragon Boat Festival",
    "Mid-Autumn Festival",
    "National Day",
    "New Year's Day",
    "Mount Huangshan",
    "Mount Qomolangma",
    "Mount Taishan",
    "The Changjiang River",
    "The Yangtze River",
    "The Great Wall",
    "The Palace Museum",
    "The Yellow River",
    "Tian'anmen Square",
    "Beijing opera",
    "Peking opera",
    "Beijing roast duck",
    "hot pot",
    "lunar calendar",
    "mooncake",
    "paper-cut",
    "qipao",
    "Spring Festival couplets",
    "Traditional Chinese Medicine",
    "TCM"
  ],
  "level3_match_forms": [
    "a",
    "a.m.",
    "ability",
    "able",
    "about",
    "above",
    "abroad",
    "absent",
    "accept",
    "accident",
    "according",
    "account",
    "ache",
    "achieve",
    "across",
    "act",
    "action",
    "active",
    "activity",
    "actor",
    "actress",
    "actually",
    "ad",
    "add",
    "address",
    "admire",
    "adult",
    "advantage",
    "advertisement",
    "advice",
    "advise",
    "afford",
    "afraid",
    "africa",
    "african",
    "after",
    "afternoon",
    "again",
    "against",
    "age",
    "ago",
    "agree",
    "ahead",
    "aid",
    "aim",
    "air",
    "airport",
    "alarm",
    "alive",
    "allow",
    "almost",
    "alone",
    "along",
    "aloud",
    "already",
    "also",
    "although",
    "always",
    "am",
    "amazing",
    "america",
    "american",
    "americana",
    "among",
    "ancient",
    "and",
    "angry",
    "animal",
    "another",
    "answer",
    "ant",
    "antarctic",
    "any",
    "anybody",
    "anyone",
    "anything",
    "anyway",
    "anywhere",
    "apartment",
    "appear",
    "apple",
    "application",
    "april",
    "are",
    "area",
    "argue",
    "arm",
    "army",
    "around",
    "arrive",
    "art",
    "article",
    "artificial",
    "artist",
    "as",
    "asia",
    "asian",
    "ask",
    "asleep",
    "astronaut",
    "at",
    "athlete",
    "attack",
    "attend",
    "attention",
    "august",
    "aunt",
    "australia",
    "australian",
    "autumn",
    "average",
    "avoid",
    "awake",
    "award",
    "aware",
    "away",
    "awful",
    "baby",
    "back",
    "background",
    "bad",
    "badminton",
    "bag",
    "balance",
    "ball",
    "balloon",
    "bamboo",
    "banana",
    "band",
    "bank",
    "baseball",
    "basic",
    "basket",
    "basketball",
    "bat",
    "bath",
    "bathroom",
    "be",
    "beach",
    "bean",
    "bear",
    "beat",
    "beautiful",
    "because",
    "become",
    "bed",
    "bedroom",
    "bee",
    "beef",
    "before",
    "begin",
    "behave",
    "behind",
    "believe",
    "bell",
    "belong",
    "below",
    "belt",
    "benefit",
    "beside",
    "best",
    "better",
    "between",
    "bicycle",
    "big",
    "bike",
    "bill",
    "bind",
    "biology",
    "bird",
    "birth",
    "birthday",
    "biscuit",
    "bit",
    "black",
    "blackboard",
    "bleed",
    "blind",
    "block",
    "blood",
    "blouse",
    "blow",
    "blue",
    "board",
    "boat",
    "body",
    "boil",
    "book",
    "boring",
    "born",
    "borrow",
    "boss",
    "both",
    "bottle",
    "bottom",
    "bowl",
    "box",
    "boy",
    "brain",
    "brave",
    "bread",
    "break",
    "breakfast",
    "breath",
    "bridge",
    "bright",
    "bring",
    "britain",
    "british",
    "brother",
    "brown",
    "brush",
    "budget",
    "build",
    "building",
    "burn",
    "bus",
    "business",
    "busy",
    "but",
    "butter",
    "butterfly",
    "by",
    "bye",
    "cabbage",
    "cage",
    "cake",
    "calendar",
    "calm",
    "camera",
    "camp",
    "can",
    "canada",
    "canadian",
    "cancel",
    "cancer",
    "candle",
    "candy",
    "cap",
    "capital",
    "car",
    "card",
    "care",
    "careful",
    "careless",
    "carrot",
    "carry",
    "cartoon",
    "case",
    "cash",
    "cat",
    "catch",
    "cause",
    "celebrate",
    "cent",
    "center",
    "central",
    "centre",
    "century",
    "chair",
    "chalk",
    "challenge",
    "champion",
    "chance",
    "change",
    "character",
    "characteristic",
    "charity",
    "chat",
    "cheap",
    "cheat",
    "check",
    "cheer",
    "cheese",
    "chemistry",
    "chess",
    "chicken",
    "child",
    "china",
    "chinese",
    "chip",
    "chocolate",
    "choice",
    "choose",
    "chopsticks",
    "christmas",
    "cinema",
    "circle",
    "citizen",
    "city",
    "class",
    "classic",
    "classmate",
    "classroom",
    "clean",
    "clear",
    "clever",
    "click",
    "climate",
    "climb",
    "clock",
    "close",
    "clothes",
    "cloud",
    "cloudy",
    "club",
    "coach",
    "coast",
    "coat",
    "coffee",
    "coin",
    "cold",
    "collect",
    "college",
    "color",
    "comfortable",
    "common",
    "communicate",
    "community",
    "company",
    "compare",
    "compete",
    "complete",
    "computer",
    "concert",
    "condition",
    "confidence",
    "congratulation",
    "connect",
    "consider",
    "continue",
    "control",
    "convenient",
    "conversation",
    "cook",
    "cookie",
    "cool",
    "cooperate",
    "copy",
    "core",
    "corn",
    "corner",
    "correct",
    "cost",
    "cotton",
    "cough",
    "could",
    "count",
    "country",
    "countryside",
    "couple",
    "courage",
    "course",
    "cousin",
    "cover",
    "cow",
    "crazy",
    "create",
    "creative",
    "cross",
    "crowded",
    "cry",
    "cucumber",
    "culture",
    "cup",
    "curious",
    "curtain",
    "customer",
    "cut",
    "cute",
    "dad",
    "daily",
    "dance",
    "danger",
    "dangerous",
    "dark",
    "date",
    "daughter",
    "day",
    "dead",
    "deaf",
    "deal",
    "dean",
    "dear",
    "death",
    "december",
    "decide",
    "deep",
    "degree",
    "delicious",
    "dentist",
    "deny",
    "depend",
    "describe",
    "desert",
    "design",
    "desk",
    "develop",
    "dialog",
    "dialogue",
    "diary",
    "dictionary",
    "die",
    "diet",
    "difference",
    "different",
    "difficult",
    "dig",
    "digital",
    "dine",
    "dinner",
    "direct",
    "director",
    "dirty",
    "disappoint",
    "disaster",
    "discover",
    "discuss",
    "disease",
    "dish",
    "divide",
    "do",
    "doctor",
    "dog",
    "doll",
    "dollar",
    "donate",
    "door",
    "double",
    "doubt",
    "down",
    "download",
    "dragon",
    "drama",
    "draw",
    "dream",
    "dress",
    "drink",
    "drive",
    "driver",
    "drop",
    "dry",
    "duck",
    "dumpling",
    "during",
    "duty",
    "each",
    "ear",
    "early",
    "earth",
    "earthquake",
    "east",
    "easy",
    "eat",
    "education",
    "effect",
    "effort",
    "egg",
    "eight",
    "eighteen",
    "eighth",
    "eighty",
    "either",
    "elder",
    "electric",
    "electronic",
    "elephant",
    "eleven",
    "eleventh",
    "else",
    "emergency",
    "emperor",
    "empty",
    "encourage",
    "end",
    "enemy",
    "energetic",
    "energy",
    "engineer",
    "england",
    "english",
    "enjoy",
    "enough",
    "enter",
    "environment",
    "era",
    "eraser",
    "especially",
    "europe",
    "european",
    "even",
    "evening",
    "event",
    "ever",
    "every",
    "everybody",
    "everyday",
    "everyone",
    "everything",
    "everywhere",
    "exactly",
    "exam",
    "examination",
    "example",
    "excellent",
    "except",
    "excite",
    "exciting",
    "excuse",
    "exercise",
    "expect",
    "expensive",
    "experience",
    "expert",
    "explain",
    "explore",
    "express",
    "eye",
    "face",
    "fact",
    "factory",
    "fail",
    "fair",
    "fall",
    "false",
    "familiar",
    "family",
    "famous",
    "fan",
    "fantastic",
    "far",
    "farm",
    "farmer",
    "fashion",
    "fast",
    "fat",
    "father",
    "favourite",
    "fear",
    "february",
    "fee",
    "feed",
